{"package_name": "java.nio.file.attribute", "subclass_list": [], "class_description": "A file attribute view that provides a view of a file's user-defined\n attributes, sometimes known as extended attributes. User-defined\n file attributes are used to store metadata with a file that is not meaningful\n to the file system. It is primarily intended for file system implementations\n that support such a capability directly but may be emulated. The details of\n such emulation are highly implementation specific and therefore not specified. This FileAttributeView provides a view of a file's user-defined\n attributes as a set of name/value pairs, where the attribute name is\n represented by a String. An implementation may require to encode and\n decode from the platform or file system representation when accessing the\n attribute. The value has opaque content. This attribute view defines the\n read and write methods to read the value into\n or write from a ByteBuffer. This FileAttributeView is not\n intended for use where the size of an attribute value is larger than Integer#MAX_VALUE. User-defined attributes may be used in some implementations to store\n security related attributes so consequently, in the case of the default\n provider at least, all methods that access user-defined attributes require the\n RuntimePermission(\"accessUserDefinedAttributes\") permission when a\n security manager is installed. The supportsFileAttributeView method may be used to test if a specific FileStore supports the storage of user-defined\n attributes. Where dynamic access to file attributes is required, the getAttribute method may be used to read\n the attribute value. The attribute value is returned as a byte array (byte[]).\n The setAttribute method may be used\n to write the value of a user-defined attribute from a buffer (as if by\n invoking the write method), or byte array (byte[]). ", "class_type": "interface", "typealias": [], "interface_list": ["FileAttributeView"], "class_inherit_list": [], "Methods": [], "class_name": "UserDefinedFileAttributeView", "Vars": null}