{"package_name": "java.time", "subclass_list": [], "class_description": "An instantaneous point on the time-line. This class models a single instantaneous point on the time-line.\n This might be used to record event time-stamps in the application. The range of an instant requires the storage of a number larger than a long.\n To achieve this, the class stores a long representing epoch-seconds and an\n int representing nanosecond-of-second, which will always be between 0 and 999,999,999.\n The epoch-seconds are measured from the standard Java epoch of 1970-01-01T00:00:00Z\n where instants after the epoch have positive values, and earlier instants have negative values.\n For both the epoch-second and nanosecond parts, a larger value is always later on the time-line\n than a smaller value. The length of the solar day is the standard way that humans measure time.\n This has traditionally been subdivided into 24 hours of 60 minutes of 60 seconds,\n forming a 86400 second day. Modern timekeeping is based on atomic clocks which precisely define an SI second\n relative to the transitions of a Caesium atom. The length of an SI second was defined\n to be very close to the 86400th fraction of a day. Unfortunately, as the Earth rotates the length of the day varies.\n In addition, over time the average length of the day is getting longer as the Earth slows.\n As a result, the length of a solar day in 2012 is slightly longer than 86400 SI seconds.\n The actual length of any given day and the amount by which the Earth is slowing\n are not predictable and can only be determined by measurement.\n The UT1 time-scale captures the accurate length of day, but is only available some\n time after the day has completed. The UTC time-scale is a standard approach to bundle up all the additional fractions\n of a second from UT1 into whole seconds, known as leap-seconds.\n A leap-second may be added or removed depending on the Earth's rotational changes.\n As such, UTC permits a day to have 86399 SI seconds or 86401 SI seconds where\n necessary in order to keep the day aligned with the Sun. The modern UTC time-scale was introduced in 1972, introducing the concept of whole leap-seconds.\n Between 1958 and 1972, the definition of UTC was complex, with minor sub-second leaps and\n alterations to the length of the notional second. As of 2012, discussions are underway\n to change the definition of UTC again, with the potential to remove leap seconds or\n introduce other changes. Given the complexity of accurate timekeeping described above, this Java API defines\n its own time-scale, the Java Time-Scale. The Java Time-Scale divides each calendar day into exactly 86400\n subdivisions, known as seconds.  These seconds may differ from the\n SI second.  It closely matches the de facto international civil time\n scale, the definition of which changes from time to time. The Java Time-Scale has slightly different definitions for different\n segments of the time-line, each based on the consensus international\n time scale that is used as the basis for civil time. Whenever the\n internationally-agreed time scale is modified or replaced, a new\n segment of the Java Time-Scale must be defined for it.  Each segment\n must meet these requirements: For the segment from 1972-11-03 (exact boundary discussed below) until\n further notice, the consensus international time scale is UTC (with\n leap seconds).  In this segment, the Java Time-Scale is identical to\n UTC-SLS.\n This is identical to UTC on days that do not have a leap second.\n On days that do have a leap second, the leap second is spread equally\n over the last 1000 seconds of the day, maintaining the appearance of\n exactly 86400 seconds per day. For the segment prior to 1972-11-03, extending back arbitrarily far,\n the consensus international time scale is defined to be UT1, applied\n proleptically, which is equivalent to the (mean) solar time on the\n prime meridian (Greenwich). In this segment, the Java Time-Scale is\n identical to the consensus international time scale. The exact\n boundary between the two segments is the instant where UT1 = UTC\n between 1972-11-03T00:00 and 1972-11-04T12:00. Implementations of the Java time-scale using the JSR-310 API are not\n required to provide any clock that is sub-second accurate, or that\n progresses monotonically or smoothly. Implementations are therefore\n not required to actually perform the UTC-SLS slew or to otherwise be\n aware of leap seconds. JSR-310 does, however, require that\n implementations must document the approach they use when defining a\n clock representing the current instant.\n See Clock for details on the available clocks. The Java time-scale is used for all date-time classes.\n This includes Instant, LocalDate, LocalTime, OffsetDateTime,\n ZonedDateTime and Duration. ", "class_type": "class", "typealias": [], "interface_list": ["Temporal", "TemporalAdjuster", "Comparable<Instant>", "Serializable"], "class_inherit_list": ["Object"], "Methods": [], "class_name": "Instant", "Vars": null}