{"package_name": "java.nio.file.spi", "subclass_list": [], "class_description": "Service-provider class for file systems. The methods defined by the Files class will typically delegate to an instance of this\n class. A file system provider is a concrete implementation of this class that\n implements the abstract methods defined by this class. A provider is\n identified by a URI scheme. The default provider\n is identified by the URI scheme \"file\". It creates the FileSystem that\n provides access to the file systems accessible to the Java virtual machine.\n The FileSystems class defines how file system providers are located\n and loaded. The default provider is typically a system-default provider but\n may be overridden if the system property java.nio.file.spi.DefaultFileSystemProvider is set. In that case, the\n provider has a one argument constructor whose formal parameter type is FileSystemProvider. All other providers have a zero argument constructor\n that initializes the provider. A provider is a factory for one or more FileSystem instances. Each\n file system is identified by a URI where the URI's scheme matches\n the provider's scheme. The default file system, for example,\n is identified by the URI \"file:///\". A memory-based file system,\n for example, may be identified by a URI such as \"memory:///?name=logfs\".\n The newFileSystem method may be used to create a file\n system, and the getFileSystem method may be used to\n obtain a reference to an existing file system created by the provider. Where\n a provider is the factory for a single file system then it is provider dependent\n if the file system is created when the provider is initialized, or later when\n the newFileSystem method is invoked. In the case of the default\n provider, the FileSystem is created when the provider is initialized. All of the methods in this class are safe for use by multiple concurrent\n threads. ", "class_type": "class", "typealias": [], "interface_list": [""], "class_inherit_list": ["Object"], "Methods": [], "class_name": "FileSystemProvider", "Vars": null}