{"package_name": "java.util", "subclass_list": [], "class_description": "A specialized Set implementation for use with enum types.  All of\n the elements in an enum set must come from a single enum type that is\n specified, explicitly or implicitly, when the set is created.  Enum sets\n are represented internally as bit vectors.  This representation is\n extremely compact and efficient. The space and time performance of this\n class should be good enough to allow its use as a high-quality, typesafe\n alternative to traditional int-based \"bit flags.\"  Even bulk\n operations (such as containsAll and retainAll) should\n run very quickly if their argument is also an enum set. The iterator returned by the iterator method traverses the\n elements in their natural order (the order in which the enum\n constants are declared).  The returned iterator is weakly\n consistent: it will never throw ConcurrentModificationException\n and it may or may not show the effects of any modifications to the set that\n occur while the iteration is in progress. Null elements are not permitted.  Attempts to insert a null element\n will throw NullPointerException.  Attempts to test for the\n presence of a null element or to remove one will, however, function\n properly. Like most collection implementations, EnumSet is not\n synchronized.  If multiple threads access an enum set concurrently, and at\n least one of the threads modifies the set, it should be synchronized\n externally.  This is typically accomplished by synchronizing on some\n object that naturally encapsulates the enum set.  If no such object exists,\n the set should be \"wrapped\" using the Collections#synchronizedSet\n method.  This is best done at creation time, to prevent accidental\n unsynchronized access: Implementation note: All basic operations execute in constant time.\n They are likely (though not guaranteed) to be much faster than their\n HashSet counterparts.  Even bulk operations execute in\n constant time if their argument is also an enum set. This class is a member of the\n \n Java Collections Framework. ", "class_type": "class", "typealias": [], "interface_list": ["Cloneable", "Serializable"], "class_inherit_list": ["AbstractSet<E extends Enum>"], "Methods": [], "class_name": "EnumSet", "Vars": null}