{"package_name": "java.util", "subclass_list": ["ConcurrentNavigableMap", "ConcurrentSkipListMap", "TreeMap", "ConcurrentNavigableMap", "ConcurrentMap", "NavigableMap", "ConcurrentSkipListMap", "ConcurrentNavigableMap", "TreeMap", "NavigableMap"], "class_description": "A SortedMap extended with navigation methods returning the\n closest matches for given search targets. Methods\n lowerEntry(K), floorEntry(K), ceilingEntry(K),\n and higherEntry(K) return Map.Entry objects\n associated with keys respectively less than, less than or equal,\n greater than or equal, and greater than a given key, returning\n null if there is no such key.  Similarly, methods\n lowerKey(K), floorKey(K), ceilingKey(K), and\n higherKey(K) return only the associated keys. All of these\n methods are designed for locating, not traversing entries. A NavigableMap may be accessed and traversed in either\n ascending or descending key order.  The descendingMap()\n method returns a view of the map with the senses of all relational\n and directional methods inverted. The performance of ascending\n operations and views is likely to be faster than that of descending\n ones.  Methods\n subMap(K, boolean, K, boolean),\n headMap(K, boolean), and\n tailMap(K, boolean)\n differ from the like-named SortedMap methods in accepting\n additional arguments describing whether lower and upper bounds are\n inclusive versus exclusive.  Submaps of any NavigableMap\n must implement the NavigableMap interface. This interface additionally defines methods firstEntry(),\n pollFirstEntry(), lastEntry(), and\n pollLastEntry() that return and/or remove the least and\n greatest mappings, if any exist, else returning null. Implementations of entry-returning methods are expected to\n return Map.Entry pairs representing snapshots of mappings\n at the time they were produced, and thus generally do not\n support the optional Entry.setValue method. Note however\n that it is possible to change mappings in the associated map using\n method put. Methods\n subMap(K, K),\n headMap(K), and\n tailMap(K)\n are specified to return SortedMap to allow existing\n implementations of SortedMap to be compatibly retrofitted to\n implement NavigableMap, but extensions and implementations\n of this interface are encouraged to override these methods to return\n NavigableMap.  Similarly,\n SortedMap.keySet() can be overridden to return NavigableSet. ", "class_type": "interface", "typealias": [], "interface_list": ["SortedMap<K", " V>"], "class_inherit_list": [], "Methods": [], "class_name": "NavigableMap", "Vars": null}