{"package_name": "java.util", "subclass_list": ["AbstractSet", "ArraySet", "ConcurrentHashMap.KeySetView", "ConcurrentSkipListSet", "CopyOnWriteArraySet", "EnumSet", "Enum", "HashSet", "LinkedHashSet", "NavigableSet", "SortedSet", "TreeSet", "AbstractSet", "ArraySet", "HashSet", "ConcurrentHashMap.KeySetView", "Set", "ConcurrentSkipListSet", "NavigableSet", "ConcurrentSkipListMap", "CopyOnWriteArraySet", "Set", "CopyOnWriteArrayList", "EnumSet", "Enum", "Set", "HashSet", "LinkedHashSet", "NavigableSet", "SortedSet", "SortedSet", "Set", "TreeSet", "NavigableSet", "TreeMap"], "class_description": "A collection that contains no duplicate elements.  More formally, sets\n contain no pair of elements e1 and e2 such that\n e1.equals(e2), and at most one null element.  As implied by\n its name, this interface models the mathematical set abstraction. The Set interface places additional stipulations, beyond those\n inherited from the Collection interface, on the contracts of all\n constructors and on the contracts of the add, equals and\n hashCode methods.  Declarations for other inherited methods are\n also included here for convenience.  (The specifications accompanying these\n declarations have been tailored to the Set interface, but they do\n not contain any additional stipulations.) The additional stipulation on constructors is, not surprisingly,\n that all constructors must create a set that contains no duplicate elements\n (as defined above). Note: Great care must be exercised if mutable objects are used as set\n elements.  The behavior of a set is not specified if the value of an object\n is changed in a manner that affects equals comparisons while the\n object is an element in the set.  A special case of this prohibition is\n that it is not permissible for a set to contain itself as an element. Some set implementations have restrictions on the elements that\n they may contain.  For example, some implementations prohibit null elements,\n and some have restrictions on the types of their elements.  Attempting to\n add an ineligible element throws an unchecked exception, typically\n NullPointerException or ClassCastException.  Attempting\n to query the presence of an ineligible element may throw an exception,\n or it may simply return false; some implementations will exhibit the former\n behavior and some will exhibit the latter.  More generally, attempting an\n operation on an ineligible element whose completion would not result in\n the insertion of an ineligible element into the set may throw an\n exception or it may succeed, at the option of the implementation.\n Such exceptions are marked as \"optional\" in the specification for this\n interface. This interface is a member of the\n \n Java Collections Framework. ", "class_type": "interface", "typealias": [], "interface_list": ["Collection"], "class_inherit_list": [], "Methods": [], "class_name": "Set", "Vars": null}