{"package_name": "java.util", "subclass_list": [], "class_description": "Hash table based implementation of the Map interface, with\n weak keys.\n An entry in a WeakHashMap will automatically be removed when\n its key is no longer in ordinary use.  More precisely, the presence of a\n mapping for a given key will not prevent the key from being discarded by the\n garbage collector, that is, made finalizable, finalized, and then reclaimed.\n When a key has been discarded its entry is effectively removed from the map,\n so this class behaves somewhat differently from other Map\n implementations. Both null values and the null key are supported. This class has\n performance characteristics similar to those of the HashMap\n class, and has the same efficiency parameters of initial capacity\n and load factor. Like most collection classes, this class is not synchronized.\n A synchronized WeakHashMap may be constructed using the\n Collections#synchronizedMap\n method. This class is intended primarily for use with key objects whose\n equals methods test for object identity using the\n == operator.  Once such a key is discarded it can never be\n recreated, so it is impossible to do a lookup of that key in a\n WeakHashMap at some later time and be surprised that its entry\n has been removed.  This class will work perfectly well with key objects\n whose equals methods are not based upon object identity, such\n as String instances.  With such recreatable key objects,\n however, the automatic removal of WeakHashMap entries whose\n keys have been discarded may prove to be confusing. The behavior of the WeakHashMap class depends in part upon\n the actions of the garbage collector, so several familiar (though not\n required) Map invariants do not hold for this class.  Because\n the garbage collector may discard keys at any time, a\n WeakHashMap may behave as though an unknown thread is silently\n removing entries.  In particular, even if you synchronize on a\n WeakHashMap instance and invoke none of its mutator methods, it\n is possible for the size method to return smaller values over\n time, for the isEmpty method to return false and\n then true, for the containsKey method to return\n true and later false for a given key, for the\n get method to return a value for a given key but later return\n null, for the put method to return\n null and the remove method to return\n false for a key that previously appeared to be in the map, and\n for successive examinations of the key set, the value collection, and\n the entry set to yield successively smaller numbers of elements. Each key object in a WeakHashMap is stored indirectly as\n the referent of a weak reference.  Therefore a key will automatically be\n removed only after the weak references to it, both inside and outside of the\n map, have been cleared by the garbage collector. Implementation note: The value objects in a\n WeakHashMap are held by ordinary strong references.  Thus care\n should be taken to ensure that value objects do not strongly refer to their\n own keys, either directly or indirectly, since that will prevent the keys\n from being discarded.  Note that a value object may refer indirectly to its\n key via the WeakHashMap itself; that is, a value object may\n strongly refer to some other key object whose associated value object, in\n turn, strongly refers to the key of the first value object.  If the values\n in the map do not rely on the map holding strong references to them, one way\n to deal with this is to wrap values themselves within\n WeakReferences before\n inserting, as in: m.put(key, new WeakReference(value)),\n and then unwrapping upon each get. The iterators returned by the iterator method of the collections\n returned by all of this class's \"collection view methods\" are\n fail-fast: if the map is structurally modified at any time after the\n iterator is created, in any way except through the iterator's own\n remove method, the iterator will throw a ConcurrentModificationException.  Thus, in the face of concurrent\n modification, the iterator fails quickly and cleanly, rather than risking\n arbitrary, non-deterministic behavior at an undetermined time in the future. Note that the fail-fast behavior of an iterator cannot be guaranteed\n as it is, generally speaking, impossible to make any hard guarantees in the\n presence of unsynchronized concurrent modification.  Fail-fast iterators\n throw ConcurrentModificationException on a best-effort basis.\n Therefore, it would be wrong to write a program that depended on this\n exception for its correctness:  the fail-fast behavior of iterators\n should be used only to detect bugs. This class is a member of the\n \n Java Collections Framework. ", "class_type": "class", "typealias": [], "interface_list": ["Map<K", " V>"], "class_inherit_list": ["AbstractMap<K, V>"], "Methods": [{"params": [{"param_name": ["initialCapacity"], "param_type": "int", "param_description": " The initial capacity of the WeakHashMap"}, {"param_name": ["loadFactor"], "param_type": "float", "param_description": " The load factor of the WeakHashMap"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Constructs a new, empty WeakHashMap with the given initial\n capacity and the given load factor.\n", "method_declar": ""}, {"params": [{"param_name": ["initialCapacity"], "param_type": "int", "param_description": " The initial capacity of the WeakHashMap"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Constructs a new, empty WeakHashMap with the given initial\n capacity and the default load factor (0.75).\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Constructs a new, empty WeakHashMap with the default initial\n capacity (16) and load factor (0.75).\n", "method_declar": ""}, {"params": [{"param_name": ["m"], "param_type": "Map", "param_description": " the map whose mappings are to be placed in this map"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Constructs a new WeakHashMap with the same mappings as the\n specified map.  The WeakHashMap is created with the default\n load factor (0.75) and an initial capacity sufficient to hold the\n mappings in the specified map.\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": [""], "return_type": []}, "method_name": "clear", "method_description": "Removes all of the mappings from this map.\n The map will be empty after this call returns.\n", "method_declar": ""}, {"params": [{"param_name": ["key"], "param_type": "Object", "param_description": " The key whose presence in this map is to be tested"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["true if there is a mapping for key;\n         false otherwise"], "return_type": ["boolean"]}, "method_name": "containsKey", "method_description": "Returns true if this map contains a mapping for the\n specified key.\n", "method_declar": ""}, {"params": [{"param_name": ["value"], "param_type": "Object", "param_description": " value whose presence in this map is to be tested"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["true if this map maps one or more keys to the\n         specified value"], "return_type": ["boolean"]}, "method_name": "containsValue", "method_description": "Returns true if this map maps one or more keys to the\n specified value.\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["a set view of the mappings contained in this map"], "return_type": ["Set<Entry<K, V>>"]}, "method_name": "entrySet", "method_description": "Returns a Set view of the mappings contained in this map.\n The set is backed by the map, so changes to the map are\n reflected in the set, and vice-versa.  If the map is modified\n while an iteration over the set is in progress (except through\n the iterator's own remove operation, or through the\n setValue operation on a map entry returned by the\n iterator) the results of the iteration are undefined.  The set\n supports element removal, which removes the corresponding\n mapping from the map, via the Iterator.remove,\n Set.remove, removeAll, retainAll and\n clear operations.  It does not support the\n add or addAll operations.\n", "method_declar": ""}, {"params": [{"param_name": ["action"], "param_type": "BiConsumer", "param_description": " The action to be performed for each entry"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": [""], "return_type": []}, "method_name": "forEach", "method_description": "Performs the given action for each entry in this map until all entries\n have been processed or the action throws an exception.   Unless\n otherwise specified by the implementing class, actions are performed in\n the order of entry set iteration (if an iteration order is specified.)\n Exceptions thrown by the action are relayed to the caller.\n", "method_declar": ""}, {"params": [{"param_name": ["key"], "param_type": "Object", "param_description": " the key whose associated value is to be returned"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["the value to which the specified key is mapped, or\n         null if this map contains no mapping for the key"], "return_type": ["V"]}, "method_name": "get", "method_description": "Returns the value to which the specified key is mapped,\n or null if this map contains no mapping for the key.\n\n \nMore formally, if this map contains a mapping from a key\n k to a value v such that (key==null ? k==null :\n key.equals(k)), then this method returns v; otherwise\n it returns null.  (There can be at most one such mapping.)\n\n \nA return value of null does not necessarily\n indicate that the map contains no mapping for the key; it's also\n possible that the map explicitly maps the key to null.\n The containsKey operation may be used to\n distinguish these two cases.\nSee also:\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["true if this map contains no key-value mappings"], "return_type": ["boolean"]}, "method_name": "isEmpty", "method_description": "Returns true if this map contains no key-value mappings.\n This result is a snapshot, and may not reflect unprocessed\n entries that will be removed before next attempted access\n because they are no longer referenced.\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["a set view of the keys contained in this map"], "return_type": ["Set<K>"]}, "method_name": "keySet", "method_description": "Returns a Set view of the keys contained in this map.\n The set is backed by the map, so changes to the map are\n reflected in the set, and vice-versa.  If the map is modified\n while an iteration over the set is in progress (except through\n the iterator's own remove operation), the results of\n the iteration are undefined.  The set supports element removal,\n which removes the corresponding mapping from the map, via the\n Iterator.remove, Set.remove,\n removeAll, retainAll, and clear\n operations.  It does not support the add or addAll\n operations.\n", "method_declar": ""}, {"params": [{"param_name": ["key"], "param_type": "K", "param_description": " key with which the specified value is to be associated."}, {"param_name": ["value"], "param_type": "V", "param_description": " value to be associated with the specified key."}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["the previous value associated with key, or\n         null if there was no mapping for key.\n         (A null return can also indicate that the map\n         previously associated null with key.)"], "return_type": ["V"]}, "method_name": "put", "method_description": "Associates the specified value with the specified key in this map.\n If the map previously contained a mapping for this key, the old\n value is replaced.\n", "method_declar": ""}, {"params": [{"param_name": ["m"], "param_type": "Map", "param_description": " mappings to be stored in this map."}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": [""], "return_type": []}, "method_name": "putAll", "method_description": "Copies all of the mappings from the specified map to this map.\n These mappings will replace any mappings that this map had for any\n of the keys currently in the specified map.\n", "method_declar": ""}, {"params": [{"param_name": ["key"], "param_type": "Object", "param_description": " key whose mapping is to be removed from the map"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["the previous value associated with key, or\n         null if there was no mapping for key"], "return_type": ["V"]}, "method_name": "remove", "method_description": "Removes the mapping for a key from this weak hash map if it is present.\n More formally, if this map contains a mapping from key k to\n value v such that (key==null ?  k==null :\n key.equals(k)), that mapping is removed.  (The map can contain\n at most one such mapping.)\n\n \nReturns the value to which this map previously associated the key,\n or null if the map contained no mapping for the key.  A\n return value of null does not necessarily indicate\n that the map contained no mapping for the key; it's also possible\n that the map explicitly mapped the key to null.\n\n \nThe map will not contain a mapping for the specified key once the\n call returns.\n", "method_declar": ""}, {"params": [{"param_name": ["function"], "param_type": "BiFunction", "param_description": " the function to apply to each entry"}], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": [""], "return_type": []}, "method_name": "replaceAll", "method_description": "Replaces each entry's value with the result of invoking the given\n function on that entry until all entries have been processed or the\n function throws an exception.  Exceptions thrown by the function are\n relayed to the caller.\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["the number of key-value mappings in this map"], "return_type": ["int"]}, "method_name": "size", "method_description": "Returns the number of key-value mappings in this map.\n This result is a snapshot, and may not reflect unprocessed\n entries that will be removed before next attempted access\n because they are no longer referenced.\n", "method_declar": ""}, {"params": [], "class_name": "WeakHashMap", "is_static": false, "return_value": {"return_name": [], "return_description": ["a collection view of the values contained in this map"], "return_type": ["Collection<V>"]}, "method_name": "values", "method_description": "Returns a Collection view of the values contained in this map.\n The collection is backed by the map, so changes to the map are\n reflected in the collection, and vice-versa.  If the map is\n modified while an iteration over the collection is in progress\n (except through the iterator's own remove operation),\n the results of the iteration are undefined.  The collection\n supports element removal, which removes the corresponding\n mapping from the map, via the Iterator.remove,\n Collection.remove, removeAll,\n retainAll and clear operations.  It does not\n support the add or addAll operations.\n", "method_declar": ""}], "class_name": "WeakHashMap", "Vars": null}