{"package_name": "java.util.regex", "subclass_list": [], "class_description": "An engine that performs match operations on a character sequence by interpreting a Pattern. A matcher is created from a pattern by invoking the pattern's Pattern#matcher method.  Once created, a matcher can be used to\n perform three different kinds of match operations: Each of these methods returns a boolean indicating success or failure.\n More information about a successful match can be obtained by querying the\n state of the matcher. A matcher finds matches in a subset of its input called the\n region. By default, the region contains all of the matcher's input.\n The region can be modified via theregion method and queried\n via the regionStart and regionEnd\n methods. The way that the region boundaries interact with some pattern\n constructs can be changed. See useAnchoringBounds and useTransparentBounds\n for more details. This class also defines methods for replacing matched subsequences with\n new strings whose contents can, if desired, be computed from the match\n result.  The appendReplacement and appendTail methods can be used in tandem in order to collect\n the result into an existing string buffer, or the more convenient replaceAll method can be used to create a string in which every\n matching subsequence in the input sequence is replaced. The explicit state of a matcher includes the start and end indices of\n the most recent successful match.  It also includes the start and end\n indices of the input subsequence captured by each capturing group in the pattern as well as a total\n count of such subsequences.  As a convenience, methods are also provided for\n returning these captured subsequences in string form. The explicit state of a matcher is initially undefined; attempting to\n query any part of it before a successful match will cause an IllegalStateException to be thrown.  The explicit state of a matcher is\n recomputed by every match operation. The implicit state of a matcher includes the input character sequence as\n well as the append position, which is initially zero and is updated\n by the appendReplacement method. A matcher may be reset explicitly by invoking its reset()\n method or, if a new input sequence is desired, its reset(CharSequence) method.  Resetting a\n matcher discards its explicit state information and sets the append position\n to zero. Instances of this class are not safe for use by multiple concurrent\n threads. ", "class_type": "class", "typealias": [], "interface_list": ["MatchResult"], "class_inherit_list": ["Object"], "Methods": [], "class_name": "Matcher", "Vars": null}