{"package_name": "java.security", "subclass_list": [], "class_description": " SignedObject is a class for the purpose of creating authentic\n runtime objects whose integrity cannot be compromised without being\n detected. More specifically, a SignedObject contains another Serializable\n object, the (to-be-)signed object and its signature. The signed object is a \"deep copy\" (in serialized form) of an\n original object.  Once the copy is made, further manipulation of\n the original object has no side effect on the copy. The underlying signing algorithm is designated by the Signature\n object passed to the constructor and the verify method.\n A typical usage for signing is the following: A typical usage for verification is the following (having\n received SignedObject so): Several points are worth noting.  First, there is no need to\n initialize the signing or verification engine, as it will be\n re-initialized inside the constructor and the verify\n method. Secondly, for verification to succeed, the specified\n public key must be the public key corresponding to the private key\n used to generate the SignedObject. More importantly, for flexibility reasons, the\n constructor and verify method allow for\n customized signature engines, which can implement signature\n algorithms that are not installed formally as part of a crypto\n provider.  However, it is crucial that the programmer writing the\n verifier code be aware what Signature engine is being\n used, as its own implementation of the verify method\n is invoked to verify a signature.  In other words, a malicious\n Signature may choose to always return true on\n verification in an attempt to bypass a security check. The signature algorithm can be, among others, the NIST standard\n DSA, using DSA and SHA-1.  The algorithm is specified using the\n same convention as that for signatures. The DSA algorithm using the\n SHA-1 message digest algorithm can be specified, for example, as\n \"SHA/DSA\" or \"SHA-1/DSA\" (they are equivalent).  In the case of\n RSA, there are multiple choices for the message digest algorithm,\n so the signing algorithm could be specified as, for example,\n \"MD2/RSA\", \"MD5/RSA\" or \"SHA-1/RSA\".  The algorithm name must be\n specified, as there is no default. The name of the Cryptography Package Provider is designated\n also by the Signature parameter to the constructor and the\n verify method.  If the provider is not\n specified, the default provider is used.  Each installation can\n be configured to use a particular provider as default. Potential applications of SignedObject include: ", "class_type": "class", "typealias": [], "interface_list": ["Serializable"], "class_inherit_list": ["Object"], "Methods": [{"params": [{"param_name": ["object"], "param_type": "Serializable", "param_description": " the object to be signed."}, {"param_name": ["signingKey"], "param_type": "PrivateKey", "param_description": " the private key for signing."}, {"param_name": ["signingEngine"], "param_type": "Signature", "param_description": " the signature signing engine."}], "class_name": "SignedObject", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Constructs a SignedObject from any Serializable object.\n The given object is signed with the given signing key, using the\n designated signature engine.\n", "method_declar": ""}, {"params": [], "class_name": "SignedObject", "is_static": false, "return_value": {"return_name": [], "return_description": ["the signature algorithm name."], "return_type": ["String"]}, "method_name": "getAlgorithm", "method_description": "Retrieves the name of the signature algorithm.\n", "method_declar": ""}, {"params": [], "class_name": "SignedObject", "is_static": false, "return_value": {"return_name": [], "return_description": ["the encapsulated object."], "return_type": ["Object"]}, "method_name": "getObject", "method_description": "Retrieves the encapsulated object.\n The encapsulated object is de-serialized before it is returned.\n", "method_declar": ""}, {"params": [], "class_name": "SignedObject", "is_static": false, "return_value": {"return_name": [], "return_description": ["the signature. Returns a new array each time this\n method is called."], "return_type": ["byte[]"]}, "method_name": "getSignature", "method_description": "Retrieves the signature on the signed object, in the form of a\n byte array.\n", "method_declar": ""}, {"params": [{"param_name": ["verificationKey"], "param_type": "PublicKey", "param_description": " the public key for verification."}, {"param_name": ["verificationEngine"], "param_type": "Signature", "param_description": " the signature verification engine."}], "class_name": "SignedObject", "is_static": false, "return_value": {"return_name": [], "return_description": ["true if the signature\n is valid, false otherwise"], "return_type": ["boolean"]}, "method_name": "verify", "method_description": "Verifies that the signature in this SignedObject is the valid\n signature for the object stored inside, with the given\n verification key, using the designated verification engine.\n", "method_declar": ""}], "class_name": "SignedObject", "Vars": null}