{"class_description": "A DistributedNotificationCenter instance broadcasts NSNotification objects to objects in other tasks that have registered for the notification with their task’s default distributed notification center.\nNotification dispatch table. See “Class at a Glance” > “Principal Attributes” in NotificationCenter for information about the dispatch table.\nIn addition to the notification name and sender, dispatch table entries for distributed notification centers specify when the notification center delivers notifications to its observers. See the postNotificationName(_:object:userInfo:deliverImmediately:) method, Suspending and Resuming Notification Delivery, and DistributedNotificationCenter.SuspensionBehavior for details.\nAccesses the default distributed notification center.\nRegisters an object to receive a notification with a specified behavior when notification delivery is suspended.\nCreates and posts a notification.\nSpecifies that an object no longer wants to receive certain notifications.\nEach task has a default distributed notification center that you access with the default() class method. There may be different types of distributed notification centers. Currently there is a single type—NSLocalNotificationCenterType. This type of distributed notification center handles notifications that can be sent between tasks on a single computer. For communication between tasks on different computers, use Distributed Objects Programming Topics.\nPosting a distributed notification is an expensive operation. The notification gets sent to a system-wide server that distributes it to all the tasks that have objects registered for distributed notifications. The latency between posting the notification and the notification’s arrival in another task is unbounded. In fact, when too many notifications are posted and the server’s queue fills up, notifications may be dropped.\nDistributed notifications are delivered via a task’s run loop. A task must be running a run loop in one of the “common” modes, such as NSDefaultRunLoopMode, to receive a distributed notification. For multithreaded applications running in macOS 10.3 and later, distributed notifications are always delivered to the main thread. For multithreaded applications running in OS X v10.2.8 and earlier, notifications are delivered to the thread that first used the distributed notifications API, which in most cases is the main thread.\nImportant\nNSDistributedNotificationCenter does not implement a secure communications protocol. When using distributed notifications, your app should treat any data passed in the notification as untrusted. See Security Overview for general guidance on secure coding practices.\nNote\nNSDistributedNotificationCenter objects should not be used to send notifications between threads within the same task. Use Distributed Objects Programming Topics or the NSObject method performSelector(onMainThread:with:waitUntilDone:), instead. You can also setup an Port object to receive and distribute messages from other threads.\n", "Methods": [], "class_inherit_list": ["NotificationCenter"], "class_name": "DistributedNotificationCenter", "typealias": [], "Vars": [], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable"], "package_name": "foundation", "subclass_list": []}