{"class_description": "An NSAttributedString object manages character strings and associated sets of attributes (for example, font and kerning) that apply to individual characters or ranges of characters in the string. An association of characters and their attributes is called an attributed string. The cluster’s two public classes, NSAttributedString and NSMutableAttributedString, declare the programmatic interface for read-only attributed strings and modifiable attributed strings, respectively.\nAn attributed string identifies attributes by name, using an NSDictionary object to store a value under the given name.  You can assign any attribute name/value pair you wish to a range of characters—it is up to your application to interpret custom attributes (see Attributed String Programming Guide). If you are using attributed strings with the Core Text framework, you can also use the attribute keys defined by that framework. \nYou use attributed strings with any APIs that accept them, such as Core Text. The AppKit and UIKit frameworks also provide a subclass of NSMutableAttributedString, called NSTextStorage, to provide the storage for the extended text-handling system. In iOS 6 and later you can use attributed strings to display formatted text in text views, text fields, and some other controls. Both AppKit and UIKit also define extensions to the basic attributed string interface that allows you to draw their contents in the current graphic context.  \nThe default font for NSAttributedString objects is Helvetica 12-point, which may differ from the default system font for the platform. Thus, you might want to create new strings with non-default attributes suitable for your application. You can also use the NSParagraphStyle class and its subclass NSMutableParagraphStyle to encapsulate the paragraph or ruler attributes used by the NSAttributedString classes.\nBe aware that comparisons of NSAttributedString objects using the isEqual(_:) method look for exact equality. The comparison includes both a character-by-character string equality check and an equality check of all attributes. Such a comparison is not likely to yield a match if the string has many attributes, such as attachments, lists, and tables, for example.\nThe NSAttributedString class is “toll-free bridged” with its Core Foundation counterpart, CFAttributedString. See Toll-Free Bridging for more information.\n", "Methods": [], "class_inherit_list": ["NSObject"], "class_name": "NSAttributedString", "typealias": [], "Vars": [{"var_description": "An NSArray object containing NSString objects, representing HTML elements not to be used in generated HTML.", "var_type": "NSAttributedString.DocumentAttributeKey", "is_static": false, "var_name": "excludedElements"}, {"var_description": "An NSString object containing the name, IANA or otherwise, of a text encoding to be used; mutually exclusive with characterEncoding.", "var_type": "NSAttributedString.DocumentAttributeKey", "is_static": false, "var_name": "textEncodingName"}, {"var_description": "An NSNumber object containing an integer (default 0) representing the number of spaces per level by which to indent certain nested HTML elements.", "var_type": "NSAttributedString.DocumentAttributeKey", "is_static": false, "var_name": "prefixSpaces"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSCopying", "NSItemProviderReading", "NSItemProviderWriting", "NSMutableCopying", "NSPasteboardReading", "NSPasteboardWriting", "NSSecureCoding"], "package_name": "foundation", "subclass_list": []}