{"class_description": "Concrete subclasses of NSClassDescription provide the available attributes of objects of a particular class and the relationships between that class and other classes. Defining these relationships between classes allows for more intelligent and flexible manipulation of objects with key-value coding.\nIt is important to note that there are no class descriptions by default. To use NSClassDescription objects in your code you have to implement them for your model classes. For all concrete subclasses, you must provide implementations for all instance methods of NSClassDescription. (NSClassDescription provides only the implementation for the class methods that maintain the cache of registered class descriptions.) Once created, you must register a class description with the NSClassDescription method register(_:for:).\nYou can use the NSString objects in the arrays returned by methods such as attributeKeys and toManyRelationshipKeys  to access—using key-value coding—the properties of an instance of the class to which a class description object corresponds. For more about attributes and relationships, see Cocoa Fundamentals Guide. For more about key-value coding, see Key-Value Coding Programming Guide.\nNSScriptClassDescription, which is used to map the relationships between scriptable classes, is the only concrete subclass of NSClassDescription provided as part of the Cocoa framework.\n", "Methods": [{"method_description": "Returns the class description for a given class.", "method_name": "init", "params": [{"param_type": "AnyClass", "param_description": "The class for which to return a class description. See note below for important details.", "param_name": ["for", "aClass"]}], "class_name": "NSClassDescription", "method_declar": "init?(for aClass: AnyClass)", "return_value": {"return_description": ["The class description for aClass, or nil if a class description cannot be found."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns the class description for a given class.", "method_name": "init", "params": [{"param_type": "AnyClass", "param_description": "The class for which to return a class description. See note below for important details.", "param_name": ["for", "aClass"]}], "class_name": "NSClassDescription", "method_declar": "init?(for aClass: AnyClass)", "return_value": {"return_description": ["The class description for aClass, or nil if a class description cannot be found."], "return_name": [], "return_type": []}, "is_static": false}], "class_inherit_list": ["NSObject"], "class_name": "NSClassDescription", "typealias": [], "Vars": [{"var_description": "Posted by init(for:) when a class description cannot be found for a class.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSClassDescriptionNeededForClass"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable"], "package_name": "foundation", "subclass_list": []}