{"package_name": "foundation", "subclass_list": ["NSSecureCoding", "UITimingCurveProvider"], "class_description": "The NSCoding protocol declares the two methods that a class must implement so that instances of that class can be encoded and decoded. This capability provides the basis for archiving (where objects and other structures are stored on disk) and distribution (where objects are copied to different address spaces).\nIn keeping with object-oriented design principles, an object being encoded or decoded is responsible for encoding and decoding its instance variables. A coder instructs the object to do so by invoking encode(with:) or init(coder:). encode(with:) instructs the object to encode its instance variables to the coder provided; an object can receive this method any number of times. init(coder:) instructs the object to initialize itself from data in the coder provided; as such, it replaces any other initialization method and is sent only once per object. Any object class that should be codeable must adopt the NSCoding protocol and implement its methods.\nIt is important to consider the possible types of archiving that a coder supports. In macOS 10.2 and later, keyed archiving is preferred. You may, however, need to support classic archiving. For details, see Archives and Serializations Programming Guide.\n", "class_type": "protocol", "typealias": [], "interface_list": [], "class_inherit_list": [], "Methods": [{"params": [{"param_name": ["coder", "aDecoder"], "param_type": "NSCoder", "param_description": ""}], "class_name": "NSCoding", "is_static": false, "return_value": {"return_name": [], "return_description": ["self, initialized using the data in decoder."], "return_type": []}, "method_name": "init", "method_description": "Returns an object initialized from data in a given unarchiver.Required.", "method_declar": "init?(coder aDecoder: NSCoder)"}, {"params": [{"param_name": ["with", "aCoder"], "param_type": "NSCoder", "param_description": ""}], "class_name": "NSCoding", "is_static": false, "return_value": {"return_name": [], "return_description": [], "return_type": []}, "method_name": "encode", "method_description": "Encodes the receiver using a given archiver.Required.", "method_declar": "func encode(with aCoder: NSCoder)"}], "class_name": "NSCoding", "Vars": []}