{"class_description": "This class allows you to set the way an NSDecimalNumber object rounds off and handles errors, without having to create a custom class.\nYou can use an instance of this class as an argument to any of the NSDecimalNumber methods that end with ...Behavior:. If you don’t think you need special behavior, you probably don’t need this class—it is likely that NSDecimalNumber's default behavior will suit your needs.\nFor more information, see the NSDecimalNumberBehaviors protocol specification.\n", "Methods": [{"method_description": "Returns an NSDecimalNumberHandler object initialized so it behaves as specified by the method’s arguments.", "method_name": "init", "params": [{"param_type": "NSDecimalNumber.RoundingMode", "param_description": "The rounding mode to use. There are four possible values: NSRoundUp, NSRoundDown, NSRoundPlain, and NSRoundBankers.", "param_name": ["roundingMode"]}, {"param_type": "Int16", "param_description": "The number of digits a rounded value should have after its decimal point.", "param_name": ["scale"]}, {"param_type": "Bool", "param_description": "If true, in the event of an exactness error the handler will raise an exception, otherwise it will ignore the error and return control to the calling method.", "param_name": ["raiseOnExactness", "exact"]}, {"param_type": "Bool", "param_description": "If true, in the event of an overflow error the handler will raise an exception, otherwise it will ignore the error and return control to the calling method", "param_name": ["raiseOnOverflow", "overflow"]}, {"param_type": "Bool", "param_description": "If true, in the event of an underflow error the handler will raise an exception, otherwise it will ignore the error and return control to the calling method", "param_name": ["raiseOnUnderflow", "underflow"]}, {"param_type": "Bool", "param_description": "If true, in the event of a divide by zero error the handler will raise an exception, otherwise it will ignore the error and return control to the calling method", "param_name": ["raiseOnDivideByZero", "divideByZero"]}], "class_name": "NSDecimalNumberHandler", "method_declar": "init(roundingMode: NSDecimalNumber.RoundingMode, scale: Int16, raiseOnExactness exact: Bool, raiseOnOverflow overflow: Bool, raiseOnUnderflow underflow: Bool, raiseOnDivideByZero divideByZero: Bool)", "return_value": {"return_description": ["An initialized NSDecimalNumberHandler object initialized with customized behavior. The returned object might be different than the original receiver."], "return_name": [], "return_type": []}, "is_static": false}], "class_inherit_list": ["NSObject"], "class_name": "NSDecimalNumberHandler", "typealias": [], "Vars": [{"var_description": "Returns the default instance of NSDecimalNumberHandler.", "var_type": "NSDecimalNumberHandler", "is_static": false, "var_name": "`default`"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSCoding", "NSDecimalNumberBehaviors"], "package_name": "foundation", "subclass_list": []}