{"class_description": "All creation methods are defined in the collection classes—such as NSArray, NSSet, and NSDictionary—which provide special NSEnumerator objects with which to enumerate their contents. For example, NSArray has two methods that return an NSEnumerator object: objectEnumerator() and reverseObjectEnumerator(). NSDictionary also has two methods that return an NSEnumerator object: keyEnumerator() and objectEnumerator(). These methods let you enumerate the contents of a dictionary by key or by value, respectively.\nYou send nextObject() repeatedly to a newly created NSEnumerator object to have it return the next object in the original collection. When the collection is exhausted, nil is returned. You cannot “reset” an enumerator after it has exhausted its collection. To enumerate a collection again, you need a new enumerator.\nThe enumerator subclasses used by NSArray, NSDictionary, and NSSet retain the collection during enumeration. When the enumeration is exhausted, the collection is released.\nNote\nIn Objective-C, it is not safe to modify a mutable collection while enumerating through it. Some enumerators may currently allow enumeration of a collection that is modified, but this behavior is not guaranteed to be supported in the future.\n", "Methods": [{"method_description": "Returns the next object from the collection being enumerated.", "method_name": "nextObject", "params": [], "class_name": "NSEnumerator", "method_declar": "func nextObject() -> Any?", "return_value": {"return_description": ["The next object from the collection being enumerated, or nil when all objects have been enumerated."], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Return an iterator over the enumerator.", "method_name": "makeIterator", "params": [], "class_name": "NSEnumerator", "method_declar": "func makeIterator() -> NSFastEnumerationIterator", "return_value": {"return_description": [], "return_name": [""], "return_type": ["NSFastEnumerationIterato"]}, "is_static": false}], "class_inherit_list": ["NSObject"], "class_name": "NSEnumerator", "typealias": [], "Vars": [{"var_description": "The array of unenumerated objects.", "var_type": "[Any]", "is_static": false, "var_name": "allObjects"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSFastEnumeration", "Sequence"], "package_name": "foundation", "subclass_list": []}