{"class_description": "The NSMetadataQuery class encapsulates the functionality provided by the MDQuery opaque type for querying the Spotlight metadata.\nNSMetadataQuery objects provide metadata query results in several ways:\nAs individual attribute values for requested attributes.\nAs value lists that contain the distinct values for given attributes in the query results.\nAs a result array proxy, containing all the query results. This is suitable for use with Cocoa bindings.\nAs a hierarchical collection of results, grouping together items with the same values for specified grouping attributes. This is also suitable for use with Cocoa bindings.\nQueries have two phases: the initial gathering phase that collects all currently matching results and a second live-update phase.\nBy default, the receiver has no limitation on its search scope. Use the searchScopes property to customize.\nBy default, notification of updated results occurs at 1.0 seconds. Use the notificationBatchingInterval property to customize.\nYou must set a predicate with the predicate property before starting a query.\n", "Methods": [], "class_inherit_list": ["NSObject"], "class_name": "NSMetadataQuery", "typealias": [], "Vars": [{"var_description": "Posted when the receiver has finished with the initial result-gathering phase of the query.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSMetadataQueryDidFinishGathering"}, {"var_description": "Posted when the receiver begins with the initial result-gathering phase of the query.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSMetadataQueryDidStartGathering"}, {"var_description": "Posted when the receiver’s results have changed during the live-update phase of the query.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSMetadataQueryDidUpdate"}, {"var_description": "Posted as the receiver is collecting results during the initial result-gathering phase of the query.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSMetadataQueryGatheringProgress"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable"], "package_name": "foundation", "subclass_list": []}