{"class_description": "The NSMutableString class declares the programmatic interface to an object that manages a mutable string—that is, a string whose contents can be edited—that conceptually represents an array of Unicode characters. To construct and manage an immutable string—or a string that cannot be changed after it has been created—use an object of the NSString class.\nThe NSMutableString class adds one primitive method—replaceCharacters(in:with:)—to the basic string-handling behavior inherited from NSString. All other methods that modify a string work through this method. For example, insert(_:at:) simply replaces the characters in a range of 0 length, while deleteCharacters(in:) replaces the characters in a given range with no characters.\nNSMutableString is “toll-free bridged” with its Core Foundation counterpart, CFMutableString. See Toll-Free Bridging for more information.\n", "Methods": [], "class_inherit_list": ["NSString"], "class_name": "NSMutableString", "typealias": [], "Vars": [{"var_description": "A constant containing the transliteration of a string from Latin script to Katakana script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToKatakana"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Hiragana script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToHiragana"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Hangul script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToHangul"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Arabic script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToArabic"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Hebrew script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToHebrew"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Thai script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToThai"}, {"var_description": "A constant containing the transliteration of a string from Latin script to Cyrillic script.", "var_type": "StringTransform", "is_static": false, "var_name": "latinToCyrillic"}, {"var_description": "A constant containing the transliteration of a string from any script to Latin script.", "var_type": "StringTransform", "is_static": false, "var_name": "toLatin"}, {"var_description": "A constant containing the transliteration of a string from Han script to Latin.", "var_type": "StringTransform", "is_static": false, "var_name": "mandarinToLatin"}, {"var_description": "A constant containing the transliteration of a string from Hiragana script to Katakana script.", "var_type": "StringTransform", "is_static": false, "var_name": "hiraganaToKatakana"}, {"var_description": "A constant containing the transformation of a string from full-width CJK characters to half-width forms.", "var_type": "StringTransform", "is_static": false, "var_name": "fullwidthToHalfwidth"}, {"var_description": "A constant containing the transformation of a string from characters to XML hexadecimal escape codes.", "var_type": "StringTransform", "is_static": false, "var_name": "toXMLHex"}, {"var_description": "An identifier for a transform that converts characters to Unicode names.", "var_type": "StringTransform", "is_static": false, "var_name": "toUnicodeName"}, {"var_description": "A constant containing the transformation of a string by removing combining marks.", "var_type": "StringTransform", "is_static": false, "var_name": "stripCombiningMarks"}, {"var_description": "A constant containing the transformation of a string by removing diacritics.", "var_type": "StringTransform", "is_static": false, "var_name": "stripDiacritics"}], "class_type": "class", "interface_list": ["CustomPlaygroundQuickLookable", "CVarArg", "Equatable", "ExpressibleByStringLiteral", "Hashable", "NSItemProviderReading", "NSItemProviderWriting"], "package_name": "foundation", "subclass_list": []}