{"package_name": "foundation", "subclass_list": [], "class_description": "As an example, the following script specifies both an application and a window by name. In this script, the named window’s implicitly specified container is the Finder application’s list of open windows.\nThis specifier works only for objects that have a name property. You don’t normally subclass NSNameSpecifier.\nThe evaluation of an instance of NSNameSpecifier follows these steps until the specified object is found:\nIf the container implements a method whose selector matches the relevant valueIn<Key>WithName: pattern established by scripting key-value coding, the method is invoked. This method can potentially be very fast, and it may be relatively easy to implement.\nAs is the case when evaluating any script object specifier, the container of the specified object is given a chance to evaluate the object specifier. If the container class implements the indicesOfObjectsByEvaluatingObjectSpecifier method, the method is invoked. This method can potentially be very fast, but it is relatively difficult to implement.\nAn instance of  NSWhoseSpecifier that specifies the first object whose relevant 'pnam' attribute matches the name is synthesized and evaluated. The instance of NSWhoseSpecifier must search through all of the keyed elements in the container, looking for a match. The search is potentially very slow.\n", "class_type": "class", "typealias": [], "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSScriptObjectSpecifier"], "Methods": [{"params": [{"param_name": ["containerClassDescription", "classDesc"], "param_type": "NSScriptClassDescription", "param_description": ""}, {"param_name": ["containerSpecifier", "container"], "param_type": "NSScriptObjectSpecifier", "param_description": ""}, {"param_name": ["key", "property"], "param_type": "String", "param_description": ""}, {"param_name": ["name"], "param_type": "String", "param_description": ""}], "class_name": "NSNameSpecifier", "is_static": false, "return_value": {"return_name": [], "return_description": [], "return_type": []}, "method_name": "init", "method_description": "Invokes the super class’s init(containerClassDescription:containerSpecifier:key:) method and then sets the name instance variable to name.", "method_declar": "init(containerClassDescription classDesc: NSScriptClassDescription, containerSpecifier container: NSScriptObjectSpecifier?, key property: String, name: String)"}, {"params": [{"param_name": ["containerClassDescription", "classDesc"], "param_type": "NSScriptClassDescription", "param_description": ""}, {"param_name": ["containerSpecifier", "container"], "param_type": "NSScriptObjectSpecifier", "param_description": ""}, {"param_name": ["key", "property"], "param_type": "String", "param_description": ""}], "class_name": "NSNameSpecifier", "is_static": false, "return_value": {"return_name": [], "return_description": ["An NSScriptObjectSpecifier object initialized with container specifier specifier, key key, and the class description of the object specifier classDescription, derived from the value of the specifier’s key. "], "return_type": []}, "method_name": "init", "method_description": "Returns an NSScriptObjectSpecifier object initialized with the given attributes.", "method_declar": "init(containerClassDescription classDesc: NSScriptClassDescription, containerSpecifier container: NSScriptObjectSpecifier?, key property: String)"}, {"params": [{"param_name": ["coder", "inCoder"], "param_type": "NSCoder", "param_description": ""}], "class_name": "NSNameSpecifier", "is_static": false, "return_value": {"return_name": [], "return_description": [], "return_type": []}, "method_name": "init", "method_description": "", "method_declar": "init?(coder inCoder: NSCoder)"}], "class_name": "NSNameSpecifier", "Vars": [{"var_description": "Sets the name encapsulated with the receiver for the specified object in the container.", "var_type": "String", "is_static": false, "var_name": "name"}]}