{"class_description": "The NSString class and its mutable subclass, NSMutableString, provide an extensive set of APIs for working with strings, including methods for comparing, searching, and modifying strings. NSString objects are used throughout Foundation and other Cocoa frameworks, serving as the basis for all textual and linguistic functionality on the platform.\nNSString is toll-free bridged with its Core Foundation counterpart, CFString. See Toll-Free Bridging for more information.\nAn NSString object encodes a Unicode-compliant text string, represented as a sequence of UTF–16 code units. All lengths, character indexes, and ranges are expressed in terms of 16-bit platform-endian values, with index values starting at 0.\nAn NSString object can be initialized from or written to a C buffer, an NSData object, or the contents of an NSURL. It can also be encoded and decoded to and from ASCII, UTF–8, UTF–16, UTF–32, or any other string encoding represented by NSStringEncoding.\nNote\nAn immutable string is a text string that is defined when it is created and subsequently cannot be changed. An immutable string is implemented as an array of UTF–16 code units (in other words, a text string). To create and manage an immutable string, use the NSString class. To construct and manage a string that can be changed after it has been created, use NSMutableString.\nThe objects you create using NSString and NSMutableString are referred to as string objects (or, when no confusion will result, merely as strings). The term C string refers to the standard char * type. \nBecause of the nature of class clusters, string objects aren’t actual instances of the NSString or NSMutableString classes but of one of their private subclasses. Although a string object’s class is private, its interface is public, as declared by these abstract superclasses, NSString and NSMutableString. The string classes adopt the NSCopying and NSMutableCopying protocols, making it convenient to convert a string of one type to the other.\nA string object presents itself as a sequence of UTF–16 code units. You can determine how many UTF-16 code units a string object contains with the length method and can retrieve a specific UTF-16 code unit with the character(at:) method. These two “primitive” methods provide basic access to a string object.\nMost use of strings, however, is at a higher level, with the strings being treated as single entities: You compare strings against one another, search them for substrings, combine them into new strings, and so on. If you need to access string objects character by character, you must understand the Unicode character encoding, specifically issues related to composed character sequences. For details see The Unicode Standard, Version 4.0 (The Unicode Consortium, Boston: Addison-Wesley, 2003, ISBN 0-321-18578-1) and the Unicode Consortium web site: http://www.unicode.org/. See also Characters and Grapheme Clusters in String Programming Guide.\nLocalized string comparisons are based on the Unicode Collation Algorithm, as tailored for different languages by CLDR (Common Locale Data Repository). Both are projects of the Unicode Consortium. Unicode is a registered trademark of Unicode, Inc.\nWhen creating an NSString object from a UTF-16-encoded string (or a byte stream interpreted as UTF-16), if the byte order is not otherwise specified, NSString assumes that the UTF-16 characters are big-endian, unless there is a BOM (byte-order mark), in which case the BOM dictates the byte order. When creating an NSString object from an array of unichar values, the returned string is always native-endian, since the array always contains UTF–16 code units in native byte order.\nIt is possible to subclass NSString (and NSMutableString), but doing so requires providing storage facilities for the string (which is not inherited by subclasses) and implementing two primitive methods. The abstract NSString and NSMutableString classes are the public interface of a class cluster consisting mostly of private, concrete classes that create and return a string object appropriate for a given situation. Making your own concrete subclass of this cluster imposes certain requirements (discussed in Methods to Override). \nMake sure your reasons for subclassing NSString are valid. Instances of your subclass should represent a string and not something else. Thus the only attributes the subclass should have are the length of the character buffer it’s managing and access to individual characters in the buffer. Valid reasons for making a subclass of NSString include providing a different backing store (perhaps for better performance) or implementing some aspect of object behavior differently, such as memory management. If your purpose is to add non-essential attributes or metadata to your subclass of NSString, a better alternative would be object composition (see Alternatives to Subclassing). Cocoa already provides an example of this with the NSAttributedString class.\nAny subclass of NSString must override the primitive instance methods length and character(at:). These methods must operate on the backing store that you provide for the characters of the string. For this backing store you can use a static array, a dynamically allocated buffer, a standard NSString object, or some other data type or mechanism. You may also choose to override, partially or fully, any other NSString method for which you want to provide an alternative implementation. For example, for better performance it is recommended that you override getCharacters(_:range:) and give it a faster implementation.\nYou might want to implement an initializer for your subclass that is suited to the backing store that the subclass is managing. The NSString class does not have a designated initializer, so your initializer need only invoke the init() method of super. The NSString class adopts the NSCopying, NSMutableCopying, and NSCoding protocols; if you want instances of your own custom subclass created from copying or coding, override the methods in these protocols.\nOften a better and easier alternative to making a subclass of NSString—or of any other abstract, public class of a class cluster, for that matter—is object composition. This is especially the case when your intent is to add to the subclass metadata or some other attribute that is not essential to a string object. In object composition, you would have an NSString object as one instance variable of your custom class (typically a subclass of NSObject) and one or more instance variables that store the metadata that you want for the custom object. Then just design your subclass interface to include accessor methods for the embedded string object and the metadata.\nIf the behavior you want to add supplements that of the existing class, you could write a category on NSString. Keep in mind, however, that this category will be in effect for all instances of NSString that you use, and this might have unintended consequences.\n", "Methods": [{"method_description": "Returns an initialized NSString object that contains no characters.", "method_name": "init", "params": [], "class_name": "NSString", "method_declar": "init()", "return_value": {"return_description": ["An initialized NSString object that contains no characters. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an initialized NSString object containing a given number of bytes from a given buffer of bytes interpreted in a given encoding.", "method_name": "init", "params": [{"param_type": "UnsafeRawPointer", "param_description": "A buffer of bytes interpreted in the encoding specified by encoding.", "param_name": ["bytes"]}, {"param_type": "Int", "param_description": "The number of bytes to use from bytes.", "param_name": ["length", "len"]}, {"param_type": "UInt", "param_description": "The character encoding applied to bytes. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}], "class_name": "NSString", "method_declar": "convenience init?(bytes: UnsafeRawPointer, length len: Int, encoding: UInt)", "return_value": {"return_description": ["An initialized NSString object containing length bytes from bytes interpreted using the encoding encoding. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an initialized NSString object that contains a given number of bytes from a given buffer of bytes interpreted in a given encoding, and optionally frees the buffer.", "method_name": "init", "params": [{"param_type": "UnsafeMutableRawPointer", "param_description": "A buffer of bytes interpreted in the encoding specified by encoding.", "param_name": ["bytesNoCopy", "bytes"]}, {"param_type": "Int", "param_description": "The number of bytes to use from bytes.", "param_name": ["length", "len"]}, {"param_type": "UInt", "param_description": "The character encoding of bytes. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}, {"param_type": "Bool", "param_description": "", "param_name": ["freeWhenDone", "freeBuffer"]}], "class_name": "NSString", "method_declar": "convenience init?(bytesNoCopy bytes: UnsafeMutableRawPointer, length len: Int, encoding: UInt, freeWhenDone freeBuffer: Bool)", "return_value": {"return_description": ["An initialized NSString object containing length bytes from bytes interpreted using the encoding encoding. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an initialized NSString object that contains a given number of characters from a given C array of UTF-16 code units.", "method_name": "init", "params": [{"param_type": "UnsafePointer<unichar>", "param_description": "A C array of UTF-16 code units; the value must not be NULL.ImportantRaises an exception if characters is NULL, even if length is 0.", "param_name": ["characters"]}, {"param_type": "Int", "param_description": "The number of characters to use from characters.", "param_name": ["length"]}], "class_name": "NSString", "method_declar": "convenience init(characters: UnsafePointer<unichar>, length: Int)", "return_value": {"return_description": ["An initialized NSString object containing length characters taken from characters. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an initialized NSString object that contains a given number of characters from a given C array of UTF-16 code units.", "method_name": "init", "params": [{"param_type": "UnsafeMutablePointer<unichar>", "param_description": "A C array of UTF-16 code units.", "param_name": ["charactersNoCopy", "characters"]}, {"param_type": "Int", "param_description": "The number of characters to use from characters.", "param_name": ["length"]}, {"param_type": "Bool", "param_description": "", "param_name": ["freeWhenDone", "freeBuffer"]}], "class_name": "NSString", "method_declar": "convenience init(charactersNoCopy characters: UnsafeMutablePointer<unichar>, length: Int, freeWhenDone freeBuffer: Bool)", "return_value": {"return_description": ["An initialized NSString object that contains length characters from characters. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by copying the characters from another given string.", "method_name": "init", "params": [{"param_type": "String", "param_description": "The string from which to copy characters. This value must not be nil.ImportantRaises an NSInvalidArgumentException if aString is nil.", "param_name": ["string", "aString"]}], "class_name": "NSString", "method_declar": "convenience init(string aString: String)", "return_value": {"return_description": ["An NSString object initialized by copying the characters from aString. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized using the characters in a given C array, interpreted according to a given encoding. ", "method_name": "init", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "A C array of characters. The array must end with a NULL character; intermediate NULL characters are not allowed.", "param_name": ["cString", "nullTerminatedCString"]}, {"param_type": "UInt", "param_description": "The encoding of nullTerminatedCString. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}], "class_name": "NSString", "method_declar": "convenience init?(cString nullTerminatedCString: UnsafePointer<Int8>, encoding: UInt)", "return_value": {"return_description": ["An NSString object initialized using the characters from nullTerminatedCString. The returned object may be different from the original receiver"], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by copying the characters from a given C array of UTF8-encoded bytes.", "method_name": "init", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "A NULL-terminated C array of bytes in UTF-8 encoding. This value must not be NULL.ImportantRaises an exception if nullTerminatedCString is NULL.", "param_name": ["utf8String", "nullTerminatedCString"]}], "class_name": "NSString", "method_declar": "convenience init?(utf8String nullTerminatedCString: UnsafePointer<Int8>)", "return_value": {"return_description": ["An NSString object initialized by copying the bytes from nullTerminatedCString. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by using a given format string as a template into which the remaining argument values are substituted without any localization.", "method_name": "init", "params": [{"param_type": "String", "param_description": "A format string. See Formatting String Objects for examples of how to use this method, and String Format Specifiers for a list of format specifiers. This value must not be nil.ImportantRaises an NSInvalidArgumentException if format is nil.", "param_name": ["format"]}, {"param_type": "CVaListPointer", "param_description": "A list of arguments to substitute into format.", "param_name": ["arguments", "argList"]}], "class_name": "NSString", "method_declar": "convenience init(format: String, arguments argList: CVaListPointer)", "return_value": {"return_description": ["An NSString object initialized by using format as a template into which the values in argList are substituted according to the current locale. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by using a given format string as a template into which the remaining argument values are substituted according to given locale information. This method is meant to be called from within a variadic function, where the argument list will be available.", "method_name": "init", "params": [{"param_type": "String", "param_description": "A format string. See Formatting String Objects for examples of how to use this method, and String Format Specifiers for a list of format specifiers. This value must not be nil.ImportantRaises an NSInvalidArgumentException if format is nil.", "param_name": ["format"]}, {"param_type": "Any", "param_description": "An NSLocale object specifying the locale to use. To use the current locale (specified by user preferences), pass [NSLocale current]. To use the system locale, pass nil. For legacy support, this may be an instance of NSDictionary containing locale information.", "param_name": ["locale"]}, {"param_type": "CVaListPointer", "param_description": "A list of arguments to substitute into format.", "param_name": ["arguments", "argList"]}], "class_name": "NSString", "method_declar": "convenience init(format: String, locale: Any?, arguments argList: CVaListPointer)", "return_value": {"return_description": ["An NSString object initialized by using format as a template into which values in argList are substituted according the locale information in locale. The returned object may be different from the original receiver."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by converting given data into UTF-16 code units using a given encoding.", "method_name": "init", "params": [{"param_type": "Data", "param_description": "An NSData object containing bytes in encoding and the default plain text format (that is, pure content with no attributes or other markups) for that encoding.", "param_name": ["data"]}, {"param_type": "UInt", "param_description": "The encoding used by data. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}], "class_name": "NSString", "method_declar": "convenience init?(data: Data, encoding: UInt)", "return_value": {"return_description": ["An NSString object initialized by converting the bytes in data into UTF-16 code units using encoding. The returned object may be different from the original receiver. Returns nil if the initialization fails for some reason (for example if data does not represent valid data for encoding)."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a localized string intended for display in a notification alert.", "method_name": "localizedUserNotificationString", "params": [{"param_type": "String", "param_description": "The key to use when looking up the string in the app’s Localizable.strings file.", "param_name": ["forKey", "key"]}, {"param_type": "[Any]", "param_description": "An array of values to substitute for escaped characters in the string. ", "param_name": ["arguments"]}], "class_name": "NSString", "method_declar": "class func localizedUserNotificationString(forKey key: String, arguments: [Any]?) -> String", "return_value": {"return_description": ["A string whose value is created dynamically from a localized string resource. If a string resource corresponding to the specified key cannot be found, the returned string is empty."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "", "method_name": "localizedStringWithFormat", "params": [{"param_type": "NSString", "param_description": "", "param_name": ["format"]}, {"param_type": "CVarArg...", "param_description": "", "param_name": ["args"]}], "class_name": "NSString", "method_declar": "class func localizedStringWithFormat(_ format: NSString, _ args: CVarArg...) -> Self", "return_value": {"return_description": [], "return_name": [""], "return_type": ["Sel"]}, "is_static": false}, {"method_description": "Returns an NSString object initialized by reading data from the file at a given path using a given encoding.", "method_name": "init", "params": [{"param_type": "String", "param_description": "A path to a file.", "param_name": ["contentsOfFile", "path"]}, {"param_type": "UInt", "param_description": "The encoding of the file at path. For possible values, see NSStringEncoding.", "param_name": ["encoding", "enc"]}], "class_name": "NSString", "method_declar": "convenience init(contentsOfFile path: String, encoding enc: UInt) throws", "return_value": {"return_description": ["An NSString object initialized by reading data from the file named by path using the encoding, enc. The returned object may be different from the original receiver. If the file can’t be opened or there is an encoding error, returns nil."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by reading data from the file at a given path and returns by reference the encoding used to interpret the characters. ", "method_name": "init", "params": [{"param_type": "String", "param_description": "A path to a file.", "param_name": ["contentsOfFile", "path"]}, {"param_type": "UnsafeMutablePointer<UInt>", "param_description": "Upon return, if the file is read successfully, contains the encoding used to interpret the file at path. For possible values, see NSStringEncoding.", "param_name": ["usedEncoding", "enc"]}], "class_name": "NSString", "method_declar": "convenience init(contentsOfFile path: String, usedEncoding enc: UnsafeMutablePointer<UInt>?) throws", "return_value": {"return_description": ["An NSString object initialized by reading data from the file named by path. The returned object may be different from the original receiver. If the file can’t be opened or there is an encoding error, returns nil."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by reading data from a given URL interpreted using a given encoding. ", "method_name": "init", "params": [{"param_type": "URL", "param_description": "The URL to read.", "param_name": ["contentsOf", "url"]}, {"param_type": "UInt", "param_description": "The encoding of the file at path. For possible values, see NSStringEncoding.", "param_name": ["encoding", "enc"]}], "class_name": "NSString", "method_declar": "convenience init(contentsOf url: URL, encoding enc: UInt) throws", "return_value": {"return_description": ["An NSString object initialized by reading data from url. The returned object may be different from the original receiver. If the URL can’t be opened or there is an encoding error, returns nil."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns an NSString object initialized by reading data from a given URL and returns by reference the encoding used to interpret the data. ", "method_name": "init", "params": [{"param_type": "URL", "param_description": "The URL from which to read data.", "param_name": ["contentsOf", "url"]}, {"param_type": "UnsafeMutablePointer<UInt>", "param_description": "Upon return, if url is read successfully, contains the encoding used to interpret the data. For possible values, see NSStringEncoding.", "param_name": ["usedEncoding", "enc"]}], "class_name": "NSString", "method_declar": "convenience init(contentsOf url: URL, usedEncoding enc: UnsafeMutablePointer<UInt>?) throws", "return_value": {"return_description": ["An NSString object initialized by reading data from url. If url can’t be opened or the encoding cannot be determined, returns nil. The returned initialized object might be different from the original receiver "], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns the number of bytes required to store the receiver in a given encoding.", "method_name": "lengthOfBytes", "params": [{"param_type": "UInt", "param_description": "The encoding for which to determine the receiver's length.", "param_name": ["using", "enc"]}], "class_name": "NSString", "method_declar": "func lengthOfBytes(using enc: UInt) -> Int", "return_value": {"return_description": ["The number of bytes required to store the receiver in the encoding enc in a non-external representation. The length does not include space for a terminating NULL character. Returns 0 if the specified encoding cannot be used to convert the receiver or if the amount of memory required for storing the results of the encoding conversion would exceed NSIntegerMax."], "return_name": [""], "return_type": ["In"]}, "is_static": false}, {"method_description": "Returns the maximum number of bytes needed to store the receiver in a given encoding.", "method_name": "maximumLengthOfBytes", "params": [{"param_type": "UInt", "param_description": "The encoding for which to determine the receiver's length.", "param_name": ["using", "enc"]}], "class_name": "NSString", "method_declar": "func maximumLengthOfBytes(using enc: UInt) -> Int", "return_value": {"return_description": ["The maximum number of bytes needed to store the receiver in encoding in a non-external representation. The length does not include space for a terminating NULL character. Returns 0 if the amount of memory required for storing the results of the encoding conversion would exceed NSIntegerMax."], "return_name": [""], "return_type": ["In"]}, "is_static": false}, {"method_description": "Returns the character at a given UTF-16 code unit index.", "method_name": "character", "params": [{"param_type": "Int", "param_description": "The index of the character to retrieve.ImportantRaises an NSRangeException if index lies beyond the end of the receiver.", "param_name": ["at", "index"]}], "class_name": "NSString", "method_declar": "func character(at index: Int) -> unichar", "return_value": {"return_description": ["The character at the array position given by index."], "return_name": [""], "return_type": ["unicha"]}, "is_static": false}, {"method_description": "Copies characters from a given range in the receiver into a given buffer.", "method_name": "getCharacters", "params": [{"param_type": "UnsafeMutablePointer<unichar>", "param_description": "Upon return, contains the characters from the receiver. buffer must be large enough to contain the characters in the range aRange (aRange.length*sizeof(unichar)).", "param_name": ["buffer"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["range"]}], "class_name": "NSString", "method_declar": "func getCharacters(_ buffer: UnsafeMutablePointer<unichar>, range: NSRange)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Gets a given range of characters as bytes in a specified encoding.", "method_name": "getBytes", "params": [{"param_type": "UnsafeMutableRawPointer", "param_description": "A buffer into which to store the bytes from the receiver. The returned bytes are not NULL-terminated.", "param_name": ["buffer"]}, {"param_type": "Int", "param_description": "The maximum number of bytes to write to buffer.", "param_name": ["maxLength", "maxBufferCount"]}, {"param_type": "UnsafeMutablePointer<Int>", "param_description": "The number of bytes used from buffer. Pass NULL if you do not need this value.", "param_name": ["usedLength", "usedBufferCount"]}, {"param_type": "UInt", "param_description": "The encoding to use for the returned bytes. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}, {"param_type": "NSString.EncodingConversionOptions", "param_description": "A mask to specify options to use for converting the receiver’s contents to encoding (if conversion is necessary).", "param_name": ["options"]}, {"param_type": "NSRange", "param_description": "The range of characters in the receiver to get.", "param_name": ["range"]}, {"param_type": "NSRangePointer", "param_description": "The remaining range. Pass NULL If you do not need this value.", "param_name": ["remaining", "leftover"]}], "class_name": "NSString", "method_declar": "func getBytes(_ buffer: UnsafeMutableRawPointer?, maxLength maxBufferCount: Int, usedLength usedBufferCount: UnsafeMutablePointer<Int>?, encoding: UInt, options: NSString.EncodingConversionOptions = [], range: NSRange, remaining leftover: NSRangePointer?) -> Bool", "return_value": {"return_description": ["true if some characters were converted, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a representation of the string as a C string using a given encoding.", "method_name": "cString", "params": [{"param_type": "UInt", "param_description": "The encoding for the returned C string. For possible values, see NSStringEncoding.", "param_name": ["using", "encoding"]}], "class_name": "NSString", "method_declar": "func cString(using encoding: UInt) -> UnsafePointer<Int8>?", "return_value": {"return_description": ["A C string representation of the receiver using the encoding specified by encoding. Returns NULL if the receiver cannot be losslessly converted to encoding."], "return_name": [""], "return_type": ["UnsafePointer<Int8"]}, "is_static": false}, {"method_description": "Converts the string to a given encoding and stores it in a buffer.", "method_name": "getCString", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "Upon return, contains the converted C-string plus the NULL termination byte. The buffer must include room for maxBufferCount bytes.", "param_name": ["buffer"]}, {"param_type": "Int", "param_description": "The maximum number of bytes in the string to return in buffer (including the NULL termination byte). ", "param_name": ["maxLength", "maxBufferCount"]}, {"param_type": "UInt", "param_description": "The encoding for the returned C string. For possible values, see NSStringEncoding.", "param_name": ["encoding"]}], "class_name": "NSString", "method_declar": "func getCString(_ buffer: UnsafeMutablePointer<Int8>, maxLength maxBufferCount: Int, encoding: UInt) -> Bool", "return_value": {"return_description": ["true if the operation was successful, otherwise false. Returns false if conversion is not possible due to encoding errors or if buffer is too small. "], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns the result of invoking compare(_:options:) with NSCaseInsensitiveSearch as the only option.", "method_name": "caseInsensitiveCompare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}], "class_name": "NSString", "method_declar": "func caseInsensitiveCompare(_ string: String) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString. "], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Compares the string with a given string using a case-insensitive, localized, comparison. ", "method_name": "localizedCaseInsensitiveCompare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}], "class_name": "NSString", "method_declar": "func localizedCaseInsensitiveCompare(_ string: String) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Returns the result of invoking compare(_:options:range:) with no options and the receiver’s full extent as the range.", "method_name": "compare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}], "class_name": "NSString", "method_declar": "func compare(_ string: String) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Compares the string and a given string using a localized comparison.", "method_name": "localizedCompare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}], "class_name": "NSString", "method_declar": "func localizedCompare(_ string: String) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Compares the string with the specified string using the given options.", "method_name": "compare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}, {"param_type": "NSString.CompareOptions = []", "param_description": "Options for the search—you can combine any of the following using a C bitwise OR operator: caseInsensitive, literal, numeric. See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}], "class_name": "NSString", "method_declar": "func compare(_ string: String, options mask: NSString.CompareOptions = []) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Returns the result of invoking compare(_:options:range:locale:) with a nil locale.", "method_name": "compare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}, {"param_type": "NSString.CompareOptions", "param_description": "Options for the search—you can combine any of the following using a C bitwise OR operator: NSCaseInsensitiveSearch, NSLiteralSearch, NSNumericSearch.See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}, {"param_type": "NSRange", "param_description": "The range of the receiver over which to perform the comparison. The range must not exceed the bounds of the receiver.ImportantRaises an NSRangeException if range exceeds the bounds of the receiver.", "param_name": ["range", "rangeOfReceiverToCompare"]}], "class_name": "NSString", "method_declar": "func compare(_ string: String, options mask: NSString.CompareOptions = [], range rangeOfReceiverToCompare: NSRange) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering. ComparisonResult.orderedAscending the receiver precedes aString in lexical ordering, ComparisonResult.orderedSame the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Compares the string using the specified options and returns the lexical ordering for the range.", "method_name": "compare", "params": [{"param_type": "String", "param_description": "", "param_name": ["string"]}, {"param_type": "NSString.CompareOptions", "param_description": "Options for the search—you can combine any of the following using a C bitwise OR operator: NSCaseInsensitiveSearch, NSLiteralSearch, NSNumericSearch.See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}, {"param_type": "NSRange", "param_description": "The range of the receiver over which to perform the comparison. The range must not exceed the bounds of the receiver.ImportantRaises an NSRangeException if range exceeds the bounds of the receiver.", "param_name": ["range", "rangeOfReceiverToCompare"]}, {"param_type": "Any", "param_description": "An instance of NSLocale. To use the current locale, pass [NSLocale current]. For example, if you are comparing strings to present to the end-user, use the current locale. To use the system locale, pass nil. ", "param_name": ["locale"]}], "class_name": "NSString", "method_declar": "func compare(_ string: String, options mask: NSString.CompareOptions = [], range rangeOfReceiverToCompare: NSRange, locale: Any?) -> ComparisonResult", "return_value": {"return_description": ["Returns an ComparisonResult value that indicates the lexical ordering of a specified range within the receiver and a given string. ComparisonResult.orderedAscending if the substring of the receiver given by range precedes aString in lexical ordering for the locale given in dict, ComparisonResult.orderedSame if the substring of the receiver and aString are equivalent in lexical value, and ComparisonResult.orderedDescending if the substring of the receiver follows aString."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Compares strings as sorted by the Finder.", "method_name": "localizedStandardCompare", "params": [{"param_type": "String", "param_description": "The string to compare with the receiver.", "param_name": ["string"]}], "class_name": "NSString", "method_declar": "func localizedStandardCompare(_ string: String) -> ComparisonResult", "return_value": {"return_description": ["The result of the comparison."], "return_name": [""], "return_type": ["ComparisonResul"]}, "is_static": false}, {"method_description": "Returns a Boolean value that indicates whether a given string matches the beginning characters of the receiver.", "method_name": "hasPrefix", "params": [{"param_type": "String", "param_description": "", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func hasPrefix(_ str: String) -> Bool", "return_value": {"return_description": ["true if aString matches the beginning characters of the receiver, otherwise false. Returns false if aString is empty."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a Boolean value that indicates whether a given string matches the ending characters of the receiver. ", "method_name": "hasSuffix", "params": [{"param_type": "String", "param_description": "", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func hasSuffix(_ str: String) -> Bool", "return_value": {"return_description": ["true if aString matches the ending characters of the receiver, otherwise false. Returns false if aString is empty. "], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a Boolean value that indicates whether a given string is equal to the receiver using a literal Unicode-based comparison.", "method_name": "isEqual", "params": [{"param_type": "String", "param_description": "The string with which to compare the receiver.", "param_name": ["to", "aString"]}], "class_name": "NSString", "method_declar": "func isEqual(to aString: String) -> Bool", "return_value": {"return_description": ["true if aString is equivalent to the receiver (if they have the same id or if they are NSOrderedSame in a literal comparison), otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "", "method_name": "appendingFormat", "params": [{"param_type": "NSString", "param_description": "", "param_name": ["format"]}, {"param_type": "CVarArg...", "param_description": "", "param_name": ["args"]}], "class_name": "NSString", "method_declar": "func appendingFormat(_ format: NSString, _ args: CVarArg...) -> NSString", "return_value": {"return_description": [], "return_name": [""], "return_type": ["NSStrin"]}, "is_static": false}, {"method_description": "Returns a new string made by appending a given string to the receiver.", "method_name": "appending", "params": [{"param_type": "String", "param_description": "The string to append to the receiver. This value must not be nil.ImportantRaises an NSInvalidArgumentException if aString is nil.", "param_name": ["aString"]}], "class_name": "NSString", "method_declar": "func appending(_ aString: String) -> String", "return_value": {"return_description": ["A new string made by appending aString to the receiver."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string formed from the receiver by either removing characters from the end, or by appending as many occurrences as necessary of a given pad string.", "method_name": "padding", "params": [{"param_type": "Int", "param_description": "The new length for the receiver.", "param_name": ["toLength", "newLength"]}, {"param_type": "String", "param_description": "The string with which to extend the receiver.", "param_name": ["withPad", "padString"]}, {"param_type": "Int", "param_description": "The index in padString from which to start padding.", "param_name": ["startingAt", "padIndex"]}], "class_name": "NSString", "method_declar": "func padding(toLength newLength: Int, withPad padString: String, startingAt padIndex: Int) -> String", "return_value": {"return_description": ["A new string formed from the receiver by either removing characters from the end, or by appending as many occurrences of padString as necessary."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a version of the string with all letters converted to lowercase, taking into account the specified locale.", "method_name": "lowercased", "params": [{"param_type": "Locale", "param_description": "The locale. For strings presented to users, pass the current locale ([NSLocale current]). To use the system locale, pass nil. ", "param_name": ["with", "locale"]}], "class_name": "NSString", "method_declar": "func lowercased(with locale: Locale?) -> String", "return_value": {"return_description": ["A lowercase string using the locale."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a version of the string with all letters converted to uppercase, taking into account the specified locale.", "method_name": "uppercased", "params": [{"param_type": "Locale", "param_description": "The locale. For strings presented to users, pass the current locale ([NSLocale current]). To use the system locale, pass nil. ", "param_name": ["with", "locale"]}], "class_name": "NSString", "method_declar": "func uppercased(with locale: Locale?) -> String", "return_value": {"return_description": ["An uppercase string using the locale."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a capitalized representation of the receiver using the specified locale.", "method_name": "capitalized", "params": [{"param_type": "Locale", "param_description": "The locale. For strings presented to users, pass the current locale ([NSLocale current]). To use the system locale, pass nil.", "param_name": ["with", "locale"]}], "class_name": "NSString", "method_declar": "func capitalized(with locale: Locale?) -> String", "return_value": {"return_description": ["A string with the first character from each word in the receiver changed to its corresponding uppercase value, and all remaining characters set to their corresponding lowercase values."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns an array containing substrings from the receiver that have been divided by a given separator.", "method_name": "components", "params": [{"param_type": "String", "param_description": "The separator string.", "param_name": ["separatedBy", "separator"]}], "class_name": "NSString", "method_declar": "func components(separatedBy separator: String) -> [String]", "return_value": {"return_description": ["An NSArray object containing substrings from the receiver that have been divided by separator."], "return_name": [""], "return_type": ["[String"]}, "is_static": false}, {"method_description": "Returns an array containing substrings from the receiver that have been divided by characters in a given set.", "method_name": "components", "params": [{"param_type": "CharacterSet", "param_description": "A character set containing the characters to to use to split the receiver. Must not be nil.", "param_name": ["separatedBy", "separator"]}], "class_name": "NSString", "method_declar": "func components(separatedBy separator: CharacterSet) -> [String]", "return_value": {"return_description": ["An NSArray object containing substrings from the receiver that have been divided by characters in separator."], "return_name": [""], "return_type": ["[String"]}, "is_static": false}, {"method_description": "Returns a new string made by removing from both ends of the receiver characters contained in a given character set.", "method_name": "trimmingCharacters", "params": [{"param_type": "CharacterSet", "param_description": "A character set containing the characters to remove from the receiver. set must not be nil.", "param_name": ["in", "set"]}], "class_name": "NSString", "method_declar": "func trimmingCharacters(in set: CharacterSet) -> String", "return_value": {"return_description": ["A new string made by removing from both ends of the receiver characters contained in set. If the receiver is composed entirely of characters from set, the empty string is returned."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string containing the characters of the receiver from the one at a given index to the end.", "method_name": "substring", "params": [{"param_type": "Int", "param_description": "", "param_name": ["from"]}], "class_name": "NSString", "method_declar": "func substring(from: Int) -> String", "return_value": {"return_description": ["A new string containing the characters of the receiver from the one at anIndex to the end. If anIndex is equal to the length of the string, returns an empty string."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a string object containing the characters of the receiver that lie within a given range.", "method_name": "substring", "params": [{"param_type": "NSRange", "param_description": "", "param_name": ["with", "range"]}], "class_name": "NSString", "method_declar": "func substring(with range: NSRange) -> String", "return_value": {"return_description": ["A string object containing the characters of the receiver that lie within aRange."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string containing the characters of the receiver up to, but not including, the one at a given index.", "method_name": "substring", "params": [{"param_type": "Int", "param_description": "", "param_name": ["to"]}], "class_name": "NSString", "method_declar": "func substring(to: Int) -> String", "return_value": {"return_description": ["A new string containing the characters of the receiver up to, but not including, the one at anIndex. If anIndex is equal to the length of the string, returns a copy of the receiver."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Creates a string suitable for comparison by removing the specified character distinctions from a string.", "method_name": "folding", "params": [{"param_type": "NSString.CompareOptions", "param_description": "Any combination of the  caseInsensitive, widthInsensitive, and diacriticInsensitive comparison options.", "param_name": ["options"]}, {"param_type": "Locale", "param_description": "The locale to use for the folding operation. Pass nil to use the system locale.", "param_name": ["locale"]}], "class_name": "NSString", "method_declar": "func folding(options: NSString.CompareOptions = [], locale: Locale?) -> String", "return_value": {"return_description": ["A string created by performing a character folding operation with the specified options and locale."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string by applying a specified transform to the string.", "method_name": "applyingTransform", "params": [{"param_type": "StringTransform", "param_description": "", "param_name": ["transform"]}, {"param_type": "Bool", "param_description": "", "param_name": ["reverse"]}], "class_name": "NSString", "method_declar": "func applyingTransform(_ transform: StringTransform, reverse: Bool) -> String?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a Boolean value indicating whether the string contains a given string by performing a case-sensitive, locale-unaware search.", "method_name": "contains", "params": [{"param_type": "String", "param_description": "The string to search for. This value must not be nil.", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func contains(_ str: String) -> Bool", "return_value": {"return_description": ["true if the receiver contains str, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a Boolean value indicating whether the string contains a given string by performing a case-insensitive, locale-aware search.", "method_name": "localizedCaseInsensitiveContains", "params": [{"param_type": "String", "param_description": "The string to search for. This value must not be nil.", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func localizedCaseInsensitiveContains(_ str: String) -> Bool", "return_value": {"return_description": ["true if the receiver contains str, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a Boolean value indicating whether the string contains a given string by performing a case and diacritic insensitive, locale-aware search.", "method_name": "localizedStandardContains", "params": [{"param_type": "String", "param_description": "The string to search for. This value must not be nil.", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func localizedStandardContains(_ str: String) -> Bool", "return_value": {"return_description": ["true if the receiver contains str, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Finds and returns the range in the string of the first character from a given character set.", "method_name": "rangeOfCharacter", "params": [{"param_type": "CharacterSet", "param_description": "", "param_name": ["from", "searchSet"]}], "class_name": "NSString", "method_declar": "func rangeOfCharacter(from searchSet: CharacterSet) -> NSRange", "return_value": {"return_description": ["The range in the receiver of the first character found from aSet. Returns a range of {NSNotFound, 0} if none of the characters in aSet are found."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range in the string of the first character, using given options, from a given character set.", "method_name": "rangeOfCharacter", "params": [{"param_type": "CharacterSet", "param_description": "", "param_name": ["from", "searchSet"]}, {"param_type": "NSString.CompareOptions = []", "param_description": "A mask specifying search options. The following options may be specified by combining them with the C bitwise OR operator: anchored, backwards.", "param_name": ["options", "mask"]}], "class_name": "NSString", "method_declar": "func rangeOfCharacter(from searchSet: CharacterSet, options mask: NSString.CompareOptions = []) -> NSRange", "return_value": {"return_description": ["The range in the receiver of the first character found from aSet. Returns a range of {NSNotFound, 0} if none of the characters in aSet are found."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range in the string of the first character from a given character set found in a given range with given options.", "method_name": "rangeOfCharacter", "params": [{"param_type": "CharacterSet", "param_description": "", "param_name": ["from", "searchSet"]}, {"param_type": "NSString.CompareOptions", "param_description": "A mask specifying search options. The following options may be specified by combining them with the C bitwise OR operator: anchored, backwards.", "param_name": ["options", "mask"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["range", "rangeOfReceiverToSearch"]}], "class_name": "NSString", "method_declar": "func rangeOfCharacter(from searchSet: CharacterSet, options mask: NSString.CompareOptions = [], range rangeOfReceiverToSearch: NSRange) -> NSRange", "return_value": {"return_description": ["The range in the receiver of the first character found from aSet within aRange. Returns a range of {NSNotFound, 0} if none of the characters in aSet are found."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range of the first occurrence of a given string within the string.", "method_name": "range", "params": [{"param_type": "String", "param_description": "The string to search for.", "param_name": ["of", "searchString"]}], "class_name": "NSString", "method_declar": "func range(of searchString: String) -> NSRange", "return_value": {"return_description": ["An NSRange structure giving the location and length in the receiver of the first occurrence of searchString. Returns {NSNotFound, 0} if searchString is not found or is empty (\"\")."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range of the first occurrence of a given string within the string, subject to given options.", "method_name": "range", "params": [{"param_type": "String", "param_description": "The string to search for. ", "param_name": ["of", "searchString"]}, {"param_type": "NSString.CompareOptions = []", "param_description": "A mask specifying search options. For possible values, see NSString.CompareOptions.", "param_name": ["options", "mask"]}], "class_name": "NSString", "method_declar": "func range(of searchString: String, options mask: NSString.CompareOptions = []) -> NSRange", "return_value": {"return_description": ["An NSRange structure giving the location and length in the receiver of the first occurrence of "], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range of the first occurrence of a given string, within the given range of the string, subject to given options.", "method_name": "range", "params": [{"param_type": "String", "param_description": "The string for which to search.", "param_name": ["of", "searchString"]}, {"param_type": "NSString.CompareOptions", "param_description": "A mask specifying search options. The following options may be specified by combining them with the C bitwise OR operator: NSCaseInsensitiveSearch, NSLiteralSearch, NSBackwardsSearch, and NSAnchoredSearch. See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}, {"param_type": "NSRange", "param_description": "The range within the receiver for which to search for aString.Raises an NSRangeException if rangeOfReceiverToSearch is invalid.", "param_name": ["range", "rangeOfReceiverToSearch"]}], "class_name": "NSString", "method_declar": "func range(of searchString: String, options mask: NSString.CompareOptions = [], range rangeOfReceiverToSearch: NSRange) -> NSRange", "return_value": {"return_description": ["An NSRange structure giving the location and length in the receiver of "], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range of the first occurrence of a given string within a given range of the string, subject to given options, using the specified locale, if any.", "method_name": "range", "params": [{"param_type": "String", "param_description": "", "param_name": ["of", "searchString"]}, {"param_type": "NSString.CompareOptions", "param_description": "A mask specifying search options. The following options may be specified by combining them with the C bitwise OR operator: NSCaseInsensitiveSearch, NSLiteralSearch, NSBackwardsSearch, and NSAnchoredSearch. See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["range", "rangeOfReceiverToSearch"]}, {"param_type": "Locale", "param_description": "The locale to use when comparing the receiver with aString. To use the current locale, pass [NSLocale current]. To use the system locale, pass nil.The locale argument affects the equality checking algorithm. For example, for the Turkish locale, case-insensitive compare matches “I” to “ı” (U+0131 LATIN SMALL DOTLESS I), not the normal “i” character.", "param_name": ["locale"]}], "class_name": "NSString", "method_declar": "func range(of searchString: String, options mask: NSString.CompareOptions = [], range rangeOfReceiverToSearch: NSRange, locale: Locale?) -> NSRange", "return_value": {"return_description": ["An NSRange structure giving the location and length in the receiver of aString within aRange in the receiver, modulo the options in mask. The range returned is relative to the start of the string, not to the passed-in range. Returns {NSNotFound, 0} if aString is not found or is empty (\"\"). "], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Finds and returns the range of the first occurrence of a given string within the string by performing a case and diacritic insensitive, locale-aware search.", "method_name": "localizedStandardRange", "params": [{"param_type": "String", "param_description": "The string to search for. This value must not be nil.", "param_name": ["of", "str"]}], "class_name": "NSString", "method_declar": "func localizedStandardRange(of str: String) -> NSRange", "return_value": {"return_description": ["The range of the first occurrence of str in the receiver. Returns {NSNotFound, 0} if str is not found."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Enumerates all the lines in the string.", "method_name": "enumerateLines", "params": [{"param_type": "@escaping (String, UnsafeMutablePointer<ObjCBool>) -> Void", "param_description": "The block executed for the enumeration.The block takes two arguments:lineThe current line of the string being enumerated. The line contains just the contents of the line, without the line terminators. See getLineStart(_:end:contentsEnd:for:) for a discussion of line terminators.stopA reference to a Boolean value that the block can use to stop the enumeration by setting *stop = YES; it should not touch *stop otherwise.", "param_name": ["block"]}], "class_name": "NSString", "method_declar": "func enumerateLines(_ block: @escaping (String, UnsafeMutablePointer<ObjCBool>) -> Void)", "return_value": {"return_description": [], "return_name": [""], "return_type": ["Void"]}, "is_static": false}, {"method_description": "Enumerates the substrings of the specified type in the specified range of the string.", "method_name": "enumerateSubstrings", "params": [{"param_type": "NSRange", "param_description": "The range within the string to enumerate substrings.", "param_name": ["in", "range"]}, {"param_type": "NSString.EnumerationOptions", "param_description": "Options specifying types of substrings and enumeration styles.", "param_name": ["options", "opts"]}, {"param_type": "@escaping (String, NSRange, NSRange, UnsafeMutablePointer<ObjCBool>) -> Void", "param_description": "The block executed for the enumeration.The block takes four arguments:substringThe enumerated string.substringRangeThe range of the enumerated string in the receiver.enclosingRangeThe range that includes the substring as well as any separator or filler characters that follow. For instance, for lines, enclosingRange contains the line terminators. The enclosingRange for the first string enumerated also contains any characters that occur before the string. Consecutive enclosing ranges are guaranteed not to overlap, and every single character in the enumerated range is included in one and only one enclosing range.stopA reference to a Boolean value that the block can use to stop the enumeration by setting *stop = YES; it should not touch *stop otherwise.", "param_name": ["using", "block"]}], "class_name": "NSString", "method_declar": "func enumerateSubstrings(in range: NSRange, options opts: NSString.EnumerationOptions = [], using block: @escaping (String?, NSRange, NSRange, UnsafeMutablePointer<ObjCBool>) -> Void)", "return_value": {"return_description": [], "return_name": [""], "return_type": ["Void"]}, "is_static": false}, {"method_description": "Returns a new string in which all occurrences of a target string in the receiver are replaced by another given string.", "method_name": "replacingOccurrences", "params": [{"param_type": "String", "param_description": "The string to replace.", "param_name": ["of", "target"]}, {"param_type": "String", "param_description": "The string with which to replace target.", "param_name": ["with", "replacement"]}], "class_name": "NSString", "method_declar": "func replacingOccurrences(of target: String, with replacement: String) -> String", "return_value": {"return_description": ["A new string in which all occurrences of target in the receiver are replaced by replacement."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string in which all occurrences of a target string in a specified range of the receiver are replaced by another given string.", "method_name": "replacingOccurrences", "params": [{"param_type": "String", "param_description": "The string to replace.", "param_name": ["of", "target"]}, {"param_type": "String", "param_description": "The string with which to replace target.", "param_name": ["with", "replacement"]}, {"param_type": "NSString.CompareOptions", "param_description": "A mask of options to use when comparing target with the receiver. Pass 0 to specify no options.", "param_name": ["options"]}, {"param_type": "NSRange", "param_description": "The range in the receiver in which to search for target.", "param_name": ["range", "searchRange"]}], "class_name": "NSString", "method_declar": "func replacingOccurrences(of target: String, with replacement: String, options: NSString.CompareOptions = [], range searchRange: NSRange) -> String", "return_value": {"return_description": ["A new string in which all occurrences of target, matched using options, in searchRange of the receiver are replaced by replacement."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string in which the characters in a specified range of the receiver are replaced by a given string.", "method_name": "replacingCharacters", "params": [{"param_type": "NSRange", "param_description": "A range of characters in the receiver.", "param_name": ["in", "range"]}, {"param_type": "String", "param_description": "The string with which to replace the characters in range.", "param_name": ["with", "replacement"]}], "class_name": "NSString", "method_declar": "func replacingCharacters(in range: NSRange, with replacement: String) -> String", "return_value": {"return_description": ["A new string in which the characters in range of the receiver are replaced by replacement."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a string containing characters the receiver and a given string have in common, starting from the beginning of each up to the first characters that aren’t equivalent.", "method_name": "commonPrefix", "params": [{"param_type": "String", "param_description": "", "param_name": ["with", "str"]}, {"param_type": "NSString.CompareOptions = []", "param_description": "Options for the comparison. The following search options may be specified by combining them with the C bitwise OR operator: NSCaseInsensitiveSearch, NSLiteralSearch. See String Programming Guide for details on these options.", "param_name": ["options", "mask"]}], "class_name": "NSString", "method_declar": "func commonPrefix(with str: String, options mask: NSString.CompareOptions = []) -> String", "return_value": {"return_description": ["A string containing characters the receiver and aString have in common, starting from the beginning of each up to the first characters that aren’t equivalent."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Performs linguistic analysis on the specified string by enumerating the specific range of the string, providing the Block with the located tags.", "method_name": "enumerateLinguisticTags", "params": [{"param_type": "NSRange", "param_description": "The range of the string to analyze.", "param_name": ["in", "range"]}, {"param_type": "NSLinguisticTagScheme", "param_description": "", "param_name": ["scheme"]}, {"param_type": "NSLinguisticTagger.Options", "param_description": "", "param_name": ["options"]}, {"param_type": "NSOrthography", "param_description": "The orthography of the string. If nil, the linguistic tagger will attempt to determine the orthography from the string content.", "param_name": ["orthography"]}, {"param_type": "(NSLinguisticTag, NSRange, NSRange, UnsafeMutablePointer<ObjCBool>) -> Void", "param_description": "The Block to apply to the string.The block takes four arguments:tagThe tag scheme for the token. The opts parameter specifies the types of tagger options that are located.tokenRangeThe range of a string matching the tag scheme.sentenceRangeThe range of the sentence in which the token is found.stopA reference to a Boolean value. The block can set the value to true to stop further processing of the array. The stop argument is an out-only argument. You should only ever set this Boolean to true within the Block.", "param_name": ["using", "block"]}], "class_name": "NSString", "method_declar": "func enumerateLinguisticTags(in range: NSRange, scheme: NSLinguisticTagScheme, options: NSLinguisticTagger.Options = [], orthography: NSOrthography?, using block: (NSLinguisticTag?, NSRange, NSRange, UnsafeMutablePointer<ObjCBool>) -> Void)", "return_value": {"return_description": [], "return_name": [""], "return_type": ["Void"]}, "is_static": false}, {"method_description": "Returns an array of linguistic tags for the specified range and requested tags within the receiving string.", "method_name": "linguisticTags", "params": [{"param_type": "NSRange", "param_description": "The range of the string to analyze.", "param_name": ["in", "range"]}, {"param_type": "NSLinguisticTagScheme", "param_description": "", "param_name": ["scheme"]}, {"param_type": "NSLinguisticTagger.Options", "param_description": "", "param_name": ["options"]}, {"param_type": "NSOrthography", "param_description": "The orthography of the string. If nil, the linguistic tagger will attempt to determine the orthography from the string content.", "param_name": ["orthography"]}, {"param_type": "AutoreleasingUnsafeMutablePointer<NSArray>", "param_description": "An array returned by-reference containing the token ranges of the linguistic tags wrapped in NSValue objects.", "param_name": ["tokenRanges"]}], "class_name": "NSString", "method_declar": "func linguisticTags(in range: NSRange, scheme: NSLinguisticTagScheme, options: NSLinguisticTagger.Options = [], orthography: NSOrthography?, tokenRanges: AutoreleasingUnsafeMutablePointer<NSArray?>?) -> [NSLinguisticTag]", "return_value": {"return_description": ["Returns an array containing the linguistic tags for the tokenRanges within the receiving string."], "return_name": [""], "return_type": ["[NSLinguisticTag"]}, "is_static": false}, {"method_description": "Returns by reference the beginning of the first line and the end of the last line touched by the given range.", "method_name": "getLineStart", "params": [{"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["startPtr"]}, {"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["end", "lineEndPtr"]}, {"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["contentsEnd", "contentsEndPtr"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["for", "range"]}], "class_name": "NSString", "method_declar": "func getLineStart(_ startPtr: UnsafeMutablePointer<Int>?, end lineEndPtr: UnsafeMutablePointer<Int>?, contentsEnd contentsEndPtr: UnsafeMutablePointer<Int>?, for range: NSRange)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns the range of characters representing the line or lines containing a given range.", "method_name": "lineRange", "params": [{"param_type": "NSRange", "param_description": "", "param_name": ["for", "range"]}], "class_name": "NSString", "method_declar": "func lineRange(for range: NSRange) -> NSRange", "return_value": {"return_description": ["The range of characters representing the line or lines containing aRange, including the line termination characters. See getLineStart(_:end:contentsEnd:for:) for a discussion of line terminators."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Returns by reference the beginning of the first paragraph and the end of the last paragraph touched by the given range.", "method_name": "getParagraphStart", "params": [{"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["startPtr"]}, {"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["end", "parEndPtr"]}, {"param_type": "UnsafeMutablePointer<Int>", "param_description": "", "param_name": ["contentsEnd", "contentsEndPtr"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["for", "range"]}], "class_name": "NSString", "method_declar": "func getParagraphStart(_ startPtr: UnsafeMutablePointer<Int>?, end parEndPtr: UnsafeMutablePointer<Int>?, contentsEnd contentsEndPtr: UnsafeMutablePointer<Int>?, for range: NSRange)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns the range of characters representing the paragraph or paragraphs containing a given range.", "method_name": "paragraphRange", "params": [{"param_type": "NSRange", "param_description": "", "param_name": ["for", "range"]}], "class_name": "NSString", "method_declar": "func paragraphRange(for range: NSRange) -> NSRange", "return_value": {"return_description": ["The range of characters representing the paragraph or paragraphs containing aRange, including the paragraph termination characters."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Returns the range in the receiver of the composed character sequence located at a given index.", "method_name": "rangeOfComposedCharacterSequence", "params": [{"param_type": "Int", "param_description": "", "param_name": ["at", "index"]}], "class_name": "NSString", "method_declar": "func rangeOfComposedCharacterSequence(at index: Int) -> NSRange", "return_value": {"return_description": ["The range in the receiver of the composed character sequence located at anIndex."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Returns the range in the string of the composed character sequences for a given range.", "method_name": "rangeOfComposedCharacterSequences", "params": [{"param_type": "NSRange", "param_description": "A range in the receiver. The range must not exceed the bounds of the receiver.", "param_name": ["for", "range"]}], "class_name": "NSString", "method_declar": "func rangeOfComposedCharacterSequences(for range: NSRange) -> NSRange", "return_value": {"return_description": ["The range in the receiver that includes the composed character sequences in range."], "return_name": [""], "return_type": ["NSRang"]}, "is_static": false}, {"method_description": "Writes the contents of the receiver to a file at a given path using a given encoding. ", "method_name": "write", "params": [{"param_type": "String", "param_description": "The file to which to write the receiver. If path contains a tilde (~) character, you must expand it with expandingTildeInPath before invoking this method.", "param_name": ["toFile", "path"]}, {"param_type": "Bool", "param_description": "If true, the receiver is written to an auxiliary file, and then the auxiliary file is renamed to path. If false, the receiver is written directly to path. The true option guarantees that path, if it exists at all, won’t be corrupted even if the system should crash during writing.", "param_name": ["atomically", "useAuxiliaryFile"]}, {"param_type": "UInt", "param_description": "The encoding to use for the output. For possible values, see NSStringEncoding.", "param_name": ["encoding", "enc"]}], "class_name": "NSString", "method_declar": "func write(toFile path: String, atomically useAuxiliaryFile: Bool, encoding enc: UInt) throws", "return_value": {"return_description": ["true if the file is written successfully, otherwise false (if there was a problem writing to the file or with the encoding)."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Writes the contents of the receiver to the URL specified by url using the specified encoding. ", "method_name": "write", "params": [{"param_type": "URL", "param_description": "The URL to which to write the receiver. Only file URLs are supported.", "param_name": ["to", "url"]}, {"param_type": "Bool", "param_description": "If true, the receiver is written to an auxiliary file, and then the auxiliary file is renamed to url. If false, the receiver is written directly to url. The true option guarantees that url, if it exists at all, won’t be corrupted even if the system should crash during writing.The useAuxiliaryFile parameter is ignored if url is not of a type that can be accessed atomically.", "param_name": ["atomically", "useAuxiliaryFile"]}, {"param_type": "UInt", "param_description": "The encoding to use for the output.", "param_name": ["encoding", "enc"]}], "class_name": "NSString", "method_declar": "func write(to url: URL, atomically useAuxiliaryFile: Bool, encoding enc: UInt) throws", "return_value": {"return_description": ["true if the URL is written successfully, otherwise false (if there was a problem writing to the URL or with the encoding)."], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Parses the receiver as a text representation of a property list, returning an NSString, NSData, NSArray, or NSDictionary object, according to the topmost element.", "method_name": "propertyList", "params": [], "class_name": "NSString", "method_declar": "func propertyList() -> Any", "return_value": {"return_description": ["A property list representation of returning an NSString, NSData, NSArray, or NSDictionary object, according to the topmost element."], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Returns a dictionary object initialized with the keys and values found in the receiver.", "method_name": "propertyListFromStringsFileFormat", "params": [], "class_name": "NSString", "method_declar": "func propertyListFromStringsFileFormat() -> [AnyHashable : Any]?", "return_value": {"return_description": ["A dictionary object initialized with the keys and values found in the receiver"], "return_name": [["[AnyHashable"]], "return_type": ["Any"]}, "is_static": false}, {"method_description": "Draws the receiver with the font and other display characteristics of the given attributes, at the specified point in the current graphics context.", "method_name": "draw", "params": [{"param_type": "CGPoint", "param_description": "The point in the current graphics context where you want to start drawing the string. The coordinate system of the graphics context is usually defined by the view in which you are drawing. In AppKit, the origin is normally in the lower-left corner of the drawing area, but the origin is in the upper-left corner if the focused view is flipped.", "param_name": ["at", "point"]}, {"param_type": "[NSAttributedString.Key", "param_description": "A dictionary of text attributes to be applied to the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["withAttributes", "attrs"]}, {"param_type": "Any] = nil", "param_description": "", "param_name": ["[NSAttributedString.Key"]}], "class_name": "NSString", "method_declar": "func draw(at point: CGPoint, withAttributes attrs: [NSAttributedString.Key : Any]? = nil)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Draws the attributed string inside the specified bounding rectangle. ", "method_name": "draw", "params": [{"param_type": "CGRect", "param_description": "The bounding rectangle in which to draw the string. In AppKit, the origin of the bounding box is normally in the lower-left corner, but the origin is in the upper-left corner if the focused view is flipped.", "param_name": ["in", "rect"]}, {"param_type": "[NSAttributedString.Key", "param_description": "The text attributes with which to draw the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["withAttributes", "attrs"]}, {"param_type": "Any] = nil", "param_description": "", "param_name": ["[NSAttributedString.Key"]}], "class_name": "NSString", "method_declar": "func draw(in rect: CGRect, withAttributes attrs: [NSAttributedString.Key : Any]? = nil)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Draws the attributed string in the specified bounding rectangle using the provided options.", "method_name": "draw", "params": [{"param_type": "CGRect", "param_description": "The bounding rectangle in which to draw the string.", "param_name": ["with", "rect"]}, {"param_type": "NSStringDrawingOptions", "param_description": "Additional drawing options to apply to the string during rendering. For a list of possible values, see NSString.DrawingOptions. ", "param_name": ["options"]}, {"param_type": "[NSAttributedString.Key", "param_description": "The text attributes with which to draw the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["attributes"]}, {"param_type": "Any]", "param_description": "", "param_name": ["[NSAttributedString.Key"]}, {"param_type": "NSStringDrawingContext", "param_description": "A context object with information about how to adjust the font tracking and scaling information. On return, the specified object contains information about the actual values used to render the string. This parameter may be nil.  ", "param_name": ["context"]}], "class_name": "NSString", "method_declar": "func draw(with rect: CGRect, options: NSStringDrawingOptions = [], attributes: [NSAttributedString.Key : Any]? = nil, context: NSStringDrawingContext?)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Calculates and returns the bounding rect for the receiver drawn using the given options and display characteristics, within the specified rectangle in the current graphics context.", "method_name": "boundingRect", "params": [{"param_type": "CGSize", "param_description": "The size of the rectangle to draw in.", "param_name": ["with", "size"]}, {"param_type": "NSStringDrawingOptions", "param_description": "String drawing options.", "param_name": ["options"]}, {"param_type": "[NSAttributedString.Key", "param_description": "A dictionary of text attributes to be applied to the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["attributes"]}, {"param_type": "Any]", "param_description": "", "param_name": ["[NSAttributedString.Key"]}, {"param_type": "NSStringDrawingContext", "param_description": "The string drawing context to use for the receiver, specifying minimum scale factor and tracking adjustments.", "param_name": ["context"]}], "class_name": "NSString", "method_declar": "func boundingRect(with size: CGSize, options: NSStringDrawingOptions = [], attributes: [NSAttributedString.Key : Any]? = nil, context: NSStringDrawingContext?) -> CGRect", "return_value": {"return_description": ["The bounding rect for the receiver drawn using the given options and display characteristics. The rect origin returned from this method is the first glyph origin."], "return_name": [""], "return_type": ["CGRec"]}, "is_static": false}, {"method_description": "Returns the bounding box size the receiver occupies when drawn with the given attributes.", "method_name": "size", "params": [{"param_type": "[NSAttributedString.Key", "param_description": "A dictionary of text attributes to be applied to the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["withAttributes", "attrs"]}, {"param_type": "Any] = nil", "param_description": "", "param_name": ["[NSAttributedString.Key"]}], "class_name": "NSString", "method_declar": "func size(withAttributes attrs: [NSAttributedString.Key : Any]? = nil) -> CGSize", "return_value": {"return_description": ["The bounding box size the receiver occupies when drawn with the specified attributes."], "return_name": [""], "return_type": ["CGSiz"]}, "is_static": false}, {"method_description": "Returns a string variation suitable for the specified presentation width. ", "method_name": "variantFittingPresentationWidth", "params": [{"param_type": "Int", "param_description": "The desired width of the string variation.", "param_name": ["width"]}], "class_name": "NSString", "method_declar": "func variantFittingPresentationWidth(_ width: Int) -> String", "return_value": {"return_description": ["A string variation, or the original string if no variations exist for the specified width.  "], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns the string encoding for the given data as detected by attempting to create a string according to the specified encoding options.", "method_name": "stringEncoding", "params": [{"param_type": "Data", "param_description": "An NSData object containing bytes in an encoding to be determined.", "param_name": ["for", "data"]}, {"param_type": "[StringEncodingDetectionOptionsKey", "param_description": "Options to use when attempting to determine the string encoding. See String Encoding Detection Options for a full list of supported options.", "param_name": ["encodingOptions", "opts"]}, {"param_type": "Any]", "param_description": "", "param_name": ["[StringEncodingDetectionOptionsKey"]}, {"param_type": "AutoreleasingUnsafeMutablePointer<NSString>", "param_description": "If a string encoding could be determined, upon return contains an NSString object constructed from data using the determined string encoding.", "param_name": ["convertedString", "string"]}, {"param_type": "UnsafeMutablePointer<ObjCBool>", "param_description": "If a string encoding could be determined, upon return contains a BOOL value corresponding to whether lossy conversion was used.", "param_name": ["usedLossyConversion"]}], "class_name": "NSString", "method_declar": "class func stringEncoding(for data: Data, encodingOptions opts: [StringEncodingDetectionOptionsKey : Any]? = nil, convertedString string: AutoreleasingUnsafeMutablePointer<NSString?>?, usedLossyConversion: UnsafeMutablePointer<ObjCBool>?) -> UInt", "return_value": {"return_description": ["An NSStringEncoding value, or 0 if a string encoding could not be determined."], "return_name": [""], "return_type": ["UIn"]}, "is_static": false}, {"method_description": "Returns a human-readable string giving the name of a given encoding.", "method_name": "localizedName", "params": [{"param_type": "UInt", "param_description": "A string encoding. For possible values, see NSStringEncoding.", "param_name": ["of", "encoding"]}], "class_name": "NSString", "method_declar": "class func localizedName(of encoding: UInt) -> String", "return_value": {"return_description": ["A human-readable string giving the name of encoding in the current locale."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a Boolean value that indicates whether the receiver can be converted to a given encoding without loss of information. ", "method_name": "canBeConverted", "params": [{"param_type": "UInt", "param_description": "A string encoding. For possible values, see NSStringEncoding.", "param_name": ["to", "encoding"]}], "class_name": "NSString", "method_declar": "func canBeConverted(to encoding: UInt) -> Bool", "return_value": {"return_description": ["true if the receiver can be converted to encoding without loss of information. Returns false if characters would have to be changed or deleted in the process of changing encodings."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns an NSData object containing a representation of the receiver encoded using a given encoding.", "method_name": "data", "params": [{"param_type": "UInt", "param_description": "A string encoding. For possible values, see NSStringEncoding.", "param_name": ["using", "encoding"]}], "class_name": "NSString", "method_declar": "func data(using encoding: UInt) -> Data?", "return_value": {"return_description": ["The result of invoking data(using:allowLossyConversion:) with false as the second argument (that is, requiring lossless conversion)."], "return_name": [""], "return_type": ["Dat"]}, "is_static": false}, {"method_description": "Returns an NSData object containing a representation of the receiver encoded using a given encoding.", "method_name": "data", "params": [{"param_type": "UInt", "param_description": "A string encoding. For possible values, see NSStringEncoding.", "param_name": ["using", "encoding"]}, {"param_type": "Bool", "param_description": "", "param_name": ["allowLossyConversion", "lossy"]}], "class_name": "NSString", "method_declar": "func data(using encoding: UInt, allowLossyConversion lossy: Bool) -> Data?", "return_value": {"return_description": ["An NSData object containing a representation of the receiver encoded using encoding. Returns nil if flag is false and the receiver can’t be converted without losing some information (such as accents or case)."], "return_name": [""], "return_type": ["Dat"]}, "is_static": false}, {"method_description": "Returns a string built from the strings in a given array by concatenating them with a path separator between each pair.", "method_name": "path", "params": [{"param_type": "[String]", "param_description": "An array of NSString objects representing a file path. To create an absolute path, use a slash mark (“/”) as the first component. To include a trailing path divider, use an empty string as the last component. ", "param_name": ["withComponents", "components"]}], "class_name": "NSString", "method_declar": "class func path(withComponents components: [String]) -> String", "return_value": {"return_description": ["A string built from the strings in components by concatenating them (in the order they appear in the array) with a path separator between each pair."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Interprets the receiver as a path in the file system and attempts to perform filename completion, returning a numeric value that indicates whether a match was possible, and by reference the longest path that matches the receiver. ", "method_name": "completePath", "params": [{"param_type": "AutoreleasingUnsafeMutablePointer<NSString>", "param_description": "Upon return, contains the longest path that matches the receiver.", "param_name": ["into", "outputName"]}, {"param_type": "Bool", "param_description": "If true, the method considers case for possible completions.", "param_name": ["caseSensitive", "flag"]}, {"param_type": "AutoreleasingUnsafeMutablePointer<NSArray>", "param_description": "Upon return, contains all matching filenames. ", "param_name": ["matchesInto", "outputArray"]}, {"param_type": "[String]", "param_description": "An array of NSString objects specifying path extensions to consider for completion. Only paths whose extensions (not including the extension separator) match one of these strings are included in outputArray. Pass nil if you don’t want to filter the output.", "param_name": ["filterTypes"]}], "class_name": "NSString", "method_declar": "func completePath(into outputName: AutoreleasingUnsafeMutablePointer<NSString?>?, caseSensitive flag: Bool, matchesInto outputArray: AutoreleasingUnsafeMutablePointer<NSArray?>?, filterTypes: [String]?) -> Int", "return_value": {"return_description": ["0 if no matches are found and 1 if exactly one match is found. In the case of multiple matches, returns the actual number of matching paths if outputArray is provided, or simply a positive value if outputArray is NULL. "], "return_name": [""], "return_type": ["In"]}, "is_static": false}, {"method_description": "Interprets the receiver as a system-independent path and fills a buffer with a C-string in a format and encoding suitable for use with file-system calls.", "method_name": "getFileSystemRepresentation", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "", "param_name": ["cname"]}, {"param_type": "Int", "param_description": "The maximum number of bytes in the string to return in buffer (including a terminating NULL character, which this method adds). ", "param_name": ["maxLength", "max"]}], "class_name": "NSString", "method_declar": "func getFileSystemRepresentation(_ cname: UnsafeMutablePointer<Int8>, maxLength max: Int) -> Bool", "return_value": {"return_description": ["true if buffer is successfully filled with a file-system representation, otherwise false (for example, if maxLength would be exceeded or if the receiver can’t be represented in the file system’s encoding)."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Returns a new string made by appending to the receiver a given string.", "method_name": "appendingPathComponent", "params": [{"param_type": "String", "param_description": "", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func appendingPathComponent(_ str: String) -> String", "return_value": {"return_description": ["A new string made by appending aString to the receiver, preceded if necessary by a path separator."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string made by appending to the receiver an extension separator followed by a given extension.", "method_name": "appendingPathExtension", "params": [{"param_type": "String", "param_description": "", "param_name": ["str"]}], "class_name": "NSString", "method_declar": "func appendingPathExtension(_ str: String) -> String?", "return_value": {"return_description": ["A new string made by appending to the receiver an extension separator followed by ext."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns an array of strings made by separately appending to the receiver each string in a given array.", "method_name": "strings", "params": [{"param_type": "[String]", "param_description": "An array of NSString objects specifying paths to add to the receiver.", "param_name": ["byAppendingPaths", "paths"]}], "class_name": "NSString", "method_declar": "func strings(byAppendingPaths paths: [String]) -> [String]", "return_value": {"return_description": ["An array of string objects made by separately appending each string in paths to the receiver, preceded if necessary by a path separator."], "return_name": [""], "return_type": ["[String"]}, "is_static": false}, {"method_description": "Returns a new string made from the receiver by replacing all characters not in the specified set with percent-encoded characters.", "method_name": "addingPercentEncoding", "params": [{"param_type": "CharacterSet", "param_description": "The characters not replaced in the string. Typically, you specify one of the predefined character sets for a particular URL component, such as urlPathAllowed or urlQueryAllowed.", "param_name": ["withAllowedCharacters", "allowedCharacters"]}], "class_name": "NSString", "method_declar": "func addingPercentEncoding(withAllowedCharacters allowedCharacters: CharacterSet) -> String?", "return_value": {"return_description": ["Returns the encoded string, or nil if the transformation is not possible."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Creates a new string using a given C-string.DeprecatedUse stringWithCString:encoding: instead.", "method_name": "string", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "", "param_name": ["withCString", "bytes"]}], "class_name": "NSString", "method_declar": "class func string(withCString bytes: UnsafePointer<Int8>) -> Any?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Initializes the receiver, a newly allocated NSString object, by converting the data in a given C-string from the default C-string encoding into the Unicode character encoding.DeprecatedUse init(cString:encoding:) instead.", "method_name": "init", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "", "param_name": ["cString", "bytes"]}], "class_name": "NSString", "method_declar": "convenience init?(cString bytes: UnsafePointer<Int8>)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a string containing the characters in a given C-string. DeprecatedUse stringWithCString:encoding: instead.", "method_name": "string", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "", "param_name": ["withCString", "bytes"]}, {"param_type": "Int", "param_description": "", "param_name": ["length"]}], "class_name": "NSString", "method_declar": "class func string(withCString bytes: UnsafePointer<Int8>, length: Int) -> Any?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Initializes the receiver, a newly allocated NSString object, by converting the data in a given C-string from the default C-string encoding into the Unicode character encoding.DeprecatedUse init(bytes:length:encoding:) instead.", "method_name": "init", "params": [{"param_type": "UnsafePointer<Int8>", "param_description": "", "param_name": ["cString", "bytes"]}, {"param_type": "Int", "param_description": "", "param_name": ["length"]}], "class_name": "NSString", "method_declar": "convenience init?(cString bytes: UnsafePointer<Int8>, length: Int)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Initializes the receiver, a newly allocated NSString object, by converting the data in a given C-string from the default C-string encoding into the Unicode character encoding.DeprecatedUse init(bytesNoCopy:length:encoding:freeWhenDone:) instead.", "method_name": "init", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "", "param_name": ["cStringNoCopy", "bytes"]}, {"param_type": "Int", "param_description": "", "param_name": ["length"]}, {"param_type": "Bool", "param_description": "", "param_name": ["freeWhenDone", "freeBuffer"]}], "class_name": "NSString", "method_declar": "convenience init?(cStringNoCopy bytes: UnsafeMutablePointer<Int8>, length: Int, freeWhenDone freeBuffer: Bool)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a string created by reading data from the file named by a given path.DeprecatedUse stringWithContentsOfFile:encoding:error: or stringWithContentsOfFile:usedEncoding:error: instead.", "method_name": "string", "params": [{"param_type": "String", "param_description": "", "param_name": ["withContentsOfFile", "path"]}], "class_name": "NSString", "method_declar": "class func string(withContentsOfFile path: String) -> Any?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Initializes the receiver, a newly allocated NSString object, by reading data from the file named by path.DeprecatedUse init(contentsOfFile:encoding:) or init(contentsOfFile:usedEncoding:) instead.", "method_name": "init", "params": [{"param_type": "String", "param_description": "", "param_name": ["contentsOfFile", "path"]}], "class_name": "NSString", "method_declar": "convenience init?(contentsOfFile path: String)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a string created by reading data from the file named by a given URL. DeprecatedUse stringWithContentsOfURL:encoding:error: or stringWithContentsOfURL:usedEncoding:error: instead.", "method_name": "string", "params": [{"param_type": "URL", "param_description": "", "param_name": ["withContentsOf", "url"]}], "class_name": "NSString", "method_declar": "class func string(withContentsOf url: URL) -> Any?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["An"]}, "is_static": false}, {"method_description": "Initializes the receiver, a newly allocated NSString object, by reading data from the location named by a given URL.DeprecatedUse init(contentsOf:encoding:) or init(contentsOf:usedEncoding:) instead.", "method_name": "init", "params": [{"param_type": "URL", "param_description": "", "param_name": ["contentsOf", "url"]}], "class_name": "NSString", "method_declar": "convenience init?(contentsOf url: URL)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Writes the contents of the receiver to the file specified by a given path.DeprecatedUse write(toFile:atomically:encoding:) instead.", "method_name": "write", "params": [{"param_type": "String", "param_description": "", "param_name": ["toFile", "path"]}, {"param_type": "Bool", "param_description": "", "param_name": ["atomically", "useAuxiliaryFile"]}], "class_name": "NSString", "method_declar": "func write(toFile path: String, atomically useAuxiliaryFile: Bool) -> Bool", "return_value": {"return_description": ["true if the file is written successfully, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Writes the contents of the receiver to the location specified by a given URL.DeprecatedUse write(to:atomically:encoding:) instead.", "method_name": "write", "params": [{"param_type": "URL", "param_description": "", "param_name": ["to", "url"]}, {"param_type": "Bool", "param_description": "", "param_name": ["atomically"]}], "class_name": "NSString", "method_declar": "func write(to url: URL, atomically: Bool) -> Bool", "return_value": {"return_description": ["true if the location is written successfully, otherwise false."], "return_name": [""], "return_type": ["Boo"]}, "is_static": false}, {"method_description": "Copies all characters from the receiver into a given buffer.DeprecatedThis method is unsafe because it could potentially cause buffer overruns. Use getCharacters(_:range:) instead.", "method_name": "getCharacters", "params": [{"param_type": "UnsafeMutablePointer<unichar>", "param_description": "Upon return, contains the characters from the receiver. buffer must be large enough to contain all characters in the string ([string length]*sizeof(unichar)).", "param_name": ["buffer"]}], "class_name": "NSString", "method_declar": "func getCharacters(_ buffer: UnsafeMutablePointer<unichar>)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a representation of the receiver as a C string in the default C-string encoding.DeprecatedUse cString(using:) or utf8String instead.", "method_name": "cString", "params": [], "class_name": "NSString", "method_declar": "func cString() -> UnsafePointer<Int8>?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["UnsafePointer<Int8"]}, "is_static": false}, {"method_description": "Returns a representation of the receiver as a C string in the default C-string encoding, possibly losing information in converting to that encoding.DeprecatedUse cString(using:) or data(using:allowLossyConversion:) instead.", "method_name": "lossyCString", "params": [], "class_name": "NSString", "method_declar": "func lossyCString() -> UnsafePointer<Int8>?", "return_value": {"return_description": [], "return_name": [""], "return_type": ["UnsafePointer<Int8"]}, "is_static": false}, {"method_description": "Returns the length in char-sized units of the receiver’s C-string representation in the default C-string encoding.DeprecatedUse lengthOfBytes(using:) or maximumLengthOfBytes(using:) instead.", "method_name": "cStringLength", "params": [], "class_name": "NSString", "method_declar": "func cStringLength() -> Int", "return_value": {"return_description": [], "return_name": [""], "return_type": ["In"]}, "is_static": false}, {"method_description": "Invokes getCString(_:maxLength:range:remaining:) with NSMaximumStringLength as the maximum length, the receiver’s entire extent as the range, and NULL for the remaining range. DeprecatedUse cString(using:) or data(using:allowLossyConversion:) instead.", "method_name": "getCString", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "", "param_name": ["bytes"]}], "class_name": "NSString", "method_declar": "func getCString(_ bytes: UnsafeMutablePointer<Int8>)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Invokes getCString(_:maxLength:range:remaining:) with maxLength as the maximum length in char-sized units, the receiver’s entire extent as the range, and NULL for the remaining range. DeprecatedUse getCString(_:maxLength:encoding:) instead.", "method_name": "getCString", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "", "param_name": ["bytes"]}, {"param_type": "Int", "param_description": "", "param_name": ["maxLength"]}], "class_name": "NSString", "method_declar": "func getCString(_ bytes: UnsafeMutablePointer<Int8>, maxLength: Int)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Converts the receiver’s content to the default C-string encoding and stores them in a given buffer. DeprecatedUse getCString(_:maxLength:encoding:) instead.", "method_name": "getCString", "params": [{"param_type": "UnsafeMutablePointer<Int8>", "param_description": "", "param_name": ["bytes"]}, {"param_type": "Int", "param_description": "", "param_name": ["maxLength"]}, {"param_type": "NSRange", "param_description": "", "param_name": ["range", "aRange"]}, {"param_type": "NSRangePointer", "param_description": "", "param_name": ["remaining", "leftoverRange"]}], "class_name": "NSString", "method_declar": "func getCString(_ bytes: UnsafeMutablePointer<Int8>, maxLength: Int, range aRange: NSRange, remaining leftoverRange: NSRangePointer?)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Returns a representation of the receiver using a given encoding to determine the percent escapes necessary to convert the receiver into a legal URL string.DeprecatedUse addingPercentEncoding(withAllowedCharacters:) instead.", "method_name": "addingPercentEscapes", "params": [{"param_type": "UInt", "param_description": "", "param_name": ["using", "enc"]}], "class_name": "NSString", "method_declar": "func addingPercentEscapes(using enc: UInt) -> String?", "return_value": {"return_description": ["A representation of the receiver using encoding to determine the percent escapes necessary to convert the receiver into a legal URL string. Returns nil if encoding cannot encode a particular character."], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Returns a new string made by replacing in the receiver all percent escapes with the matching characters as determined by a given encoding.DeprecatedUse removingPercentEncoding instead.", "method_name": "replacingPercentEscapes", "params": [{"param_type": "UInt", "param_description": "", "param_name": ["using", "enc"]}], "class_name": "NSString", "method_declar": "func replacingPercentEscapes(using enc: UInt) -> String?", "return_value": {"return_description": ["A new string made by replacing in the receiver all percent escapes with the matching characters as determined by the given encoding encoding. Returns nil if the transformation is not possible, for example, the percent escapes give a byte sequence not legal in encoding. "], "return_name": [""], "return_type": ["Strin"]}, "is_static": false}, {"method_description": "Draws the receiver with the specified options and other display characteristics of the given attributes, within the specified rectangle in the current graphics context.", "method_name": "draw", "params": [{"param_type": "NSRect", "param_description": "The rectangle in which to draw the string.", "param_name": ["with", "rect"]}, {"param_type": "NSString.DrawingOptions", "param_description": "String drawing options.", "param_name": ["options"]}, {"param_type": "[NSAttributedString.Key", "param_description": "A dictionary of text attributes to be applied to the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["attributes"]}, {"param_type": "Any] = nil", "param_description": "", "param_name": ["[NSAttributedString.Key"]}], "class_name": "NSString", "method_declar": "func draw(with rect: NSRect, options: NSString.DrawingOptions = [], attributes: [NSAttributedString.Key : Any]? = nil)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Calculates and returns the bounding rect for the receiver drawn using the given options and display characteristics, within the specified rectangle in the current graphics context.", "method_name": "boundingRect", "params": [{"param_type": "NSSize", "param_description": "The size of the rectangle to draw in.", "param_name": ["with", "size"]}, {"param_type": "NSString.DrawingOptions", "param_description": "String drawing options.", "param_name": ["options"]}, {"param_type": "[NSAttributedString.Key", "param_description": "A dictionary of text attributes to be applied to the string. These are the same attributes that can be applied to an NSAttributedString object, but in the case of NSString objects, the attributes apply to the entire string, rather than ranges within the string.", "param_name": ["attributes"]}, {"param_type": "Any] = nil", "param_description": "", "param_name": ["[NSAttributedString.Key"]}], "class_name": "NSString", "method_declar": "func boundingRect(with size: NSSize, options: NSString.DrawingOptions = [], attributes: [NSAttributedString.Key : Any]? = nil) -> NSRect", "return_value": {"return_description": ["The bounding rect for the receiver drawn using the given options and display characteristics. The rect origin returned from this method is the first glyph origin."], "return_name": [""], "return_type": ["NSRec"]}, "is_static": false}, {"method_description": "", "method_name": "init", "params": [{"param_type": "NSCoder", "param_description": "", "param_name": ["coder", "aDecoder"]}], "class_name": "NSString", "method_declar": "init?(coder aDecoder: NSCoder)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "Create an instance initialized to value.", "method_name": "init", "params": [{"param_type": "StaticString", "param_description": "", "param_name": ["stringLiteral", "value"]}], "class_name": "NSString", "method_declar": "required convenience init(stringLiteral value: StaticString)", "return_value": {"return_description": [], "return_name": [], "return_type": []}, "is_static": false}, {"method_description": "", "method_name": "deferredLocalizedIntentsString", "params": [{"param_type": "String", "param_description": "", "param_name": ["with", "format"]}, {"param_type": "CVarArg...", "param_description": "", "param_name": ["args"]}], "class_name": "NSString", "method_declar": "class func deferredLocalizedIntentsString(with format: String, _ args: CVarArg...) -> NSString", "return_value": {"return_description": [], "return_name": [""], "return_type": ["NSStrin"]}, "is_static": false}, {"method_description": "", "method_name": "deferredLocalizedIntentsString", "params": [{"param_type": "String", "param_description": "", "param_name": ["with", "format"]}, {"param_type": "String", "param_description": "", "param_name": ["table"]}, {"param_type": "CVarArg...", "param_description": "", "param_name": ["args"]}], "class_name": "NSString", "method_declar": "class func deferredLocalizedIntentsString(with format: String, table: String, _ args: CVarArg...) -> NSString", "return_value": {"return_description": [], "return_name": [""], "return_type": ["NSStrin"]}, "is_static": false}, {"method_description": "", "method_name": "deferredLocalizedIntentsString", "params": [{"param_type": "String", "param_description": "", "param_name": ["with", "format"]}, {"param_type": "String", "param_description": "", "param_name": ["table"]}, {"param_type": "CVaListPointer", "param_description": "", "param_name": ["arguments"]}], "class_name": "NSString", "method_declar": "class func deferredLocalizedIntentsString(with format: String, table: String, arguments: CVaListPointer) -> NSString", "return_value": {"return_description": [], "return_name": [""], "return_type": ["NSStrin"]}, "is_static": false}], "class_inherit_list": ["NSObject"], "class_name": "NSString", "typealias": ["typealias unichar = UInt16"], "Vars": [{"var_description": "The number of UTF-16 code units in the receiver.", "var_type": "Int", "is_static": false, "var_name": "length"}, {"var_description": "A null-terminated UTF8 representation of the string.", "var_type": "UnsafePointer<Int8>", "is_static": false, "var_name": "utf8String"}, {"var_description": "An unsigned integer that can be used as a hash table address.", "var_type": "Int", "is_static": false, "var_name": "hash"}, {"var_description": "A lowercase representation of the string.", "var_type": "String", "is_static": false, "var_name": "lowercased"}, {"var_description": "Returns a version of the string with all letters converted to lowercase, taking into account the current locale.", "var_type": "String", "is_static": false, "var_name": "localizedLowercase"}, {"var_description": "An uppercase representation of the string.", "var_type": "String", "is_static": false, "var_name": "uppercased"}, {"var_description": "Returns a version of the string with all letters converted to uppercase, taking into account the current locale.", "var_type": "String", "is_static": false, "var_name": "localizedUppercase"}, {"var_description": "A capitalized representation of the string.", "var_type": "String", "is_static": false, "var_name": "capitalized"}, {"var_description": "Returns a capitalized representation of the receiver using the current locale.", "var_type": "String", "is_static": false, "var_name": "localizedCapitalized"}, {"var_description": "A string made by normalizing the string’s contents using the Unicode Normalization Form D.", "var_type": "String", "is_static": false, "var_name": "decomposedStringWithCanonicalMapping"}, {"var_description": "A string made by normalizing the receiver’s contents using the Unicode Normalization Form KD.", "var_type": "String", "is_static": false, "var_name": "decomposedStringWithCompatibilityMapping"}, {"var_description": "A string made by normalizing the string’s contents using the Unicode Normalization Form C.", "var_type": "String", "is_static": false, "var_name": "precomposedStringWithCanonicalMapping"}, {"var_description": "A string made by normalizing the receiver’s contents using the Unicode Normalization Form KC.", "var_type": "String", "is_static": false, "var_name": "precomposedStringWithCompatibilityMapping"}, {"var_description": "The floating-point value of the string as a double.", "var_type": "Double", "is_static": false, "var_name": "doubleValue"}, {"var_description": "The floating-point value of the string as a float.", "var_type": "Float", "is_static": false, "var_name": "floatValue"}, {"var_description": "The integer value of the string.", "var_type": "Int32", "is_static": false, "var_name": "intValue"}, {"var_description": "The NSInteger value of the string.", "var_type": "Int", "is_static": false, "var_name": "integerValue"}, {"var_description": "The long long value of the string.", "var_type": "Int64", "is_static": false, "var_name": "longLongValue"}, {"var_description": "The Boolean value of the string.", "var_type": "Bool", "is_static": false, "var_name": "boolValue"}, {"var_description": "Returns a zero-terminated list of the encodings string objects support in the application’s environment.", "var_type": "UnsafePointer<UInt>", "is_static": false, "var_name": "availableStringEncodings"}, {"var_description": "Returns the C-string encoding assumed for any method accepting a C string as an argument.", "var_type": "UInt", "is_static": false, "var_name": "defaultCStringEncoding"}, {"var_description": "This NSString object.", "var_type": "String", "is_static": false, "var_name": "description"}, {"var_description": "The fastest encoding to which the receiver may be converted without loss of information.", "var_type": "UInt", "is_static": false, "var_name": "fastestEncoding"}, {"var_description": "The smallest encoding to which the receiver can be converted without loss of information.", "var_type": "UInt", "is_static": false, "var_name": "smallestEncoding"}, {"var_description": "NSString raises an NSCharacterConversionException if a string cannot be represented in a file-system or string encoding.", "var_type": "NSExceptionName", "is_static": false, "var_name": "characterConversionException"}, {"var_description": "NSString raises an NSParseErrorException if a string cannot be parsed as a property list.", "var_type": "NSExceptionName", "is_static": false, "var_name": "parseErrorException"}, {"var_description": "The file-system path components of the receiver.", "var_type": "[String]", "is_static": false, "var_name": "pathComponents"}, {"var_description": "A file system-specific representation of the receiver. ", "var_type": "UnsafePointer<Int8>", "is_static": false, "var_name": "fileSystemRepresentation"}, {"var_description": "A Boolean value that indicates whether the receiver represents an absolute path.", "var_type": "Bool", "is_static": false, "var_name": "isAbsolutePath"}, {"var_description": "The last path component of the receiver.", "var_type": "String", "is_static": false, "var_name": "lastPathComponent"}, {"var_description": "The path extension, if any, of the string as interpreted as a path.", "var_type": "String", "is_static": false, "var_name": "pathExtension"}, {"var_description": "A new string that replaces the current home directory portion of the current path with a tilde (~) character.", "var_type": "String", "is_static": false, "var_name": "abbreviatingWithTildeInPath"}, {"var_description": "A new string made by deleting the last path component from the receiver, along with any final path separator.", "var_type": "String", "is_static": false, "var_name": "deletingLastPathComponent"}, {"var_description": "A new string made by deleting the extension (if any, and only the last) from the receiver.", "var_type": "String", "is_static": false, "var_name": "deletingPathExtension"}, {"var_description": "A new string made by expanding the initial component of the receiver to its full path value.", "var_type": "String", "is_static": false, "var_name": "expandingTildeInPath"}, {"var_description": "A new string made from the receiver by resolving all symbolic links and standardizing path. ", "var_type": "String", "is_static": false, "var_name": "resolvingSymlinksInPath"}, {"var_description": "A new string made by removing extraneous path components from the receiver.", "var_type": "String", "is_static": false, "var_name": "standardizingPath"}, {"var_description": "Returns a new string made from the receiver by replacing all percent encoded sequences with the matching UTF-8 characters.", "var_type": "String", "is_static": false, "var_name": "removingPercentEncoding"}, {"var_description": "", "var_type": "PlaygroundQuickLook", "is_static": false, "var_name": "customPlaygroundQuickLook"}], "class_type": "class", "interface_list": ["CKRecordValueProtocol", "CustomPlaygroundQuickLookable", "CVarArg", "Equatable", "ExpressibleByStringLiteral", "Hashable", "NSCopying", "NSItemProviderReading", "NSItemProviderWriting", "NSMutableCopying", "NSPasteboardReading", "NSPasteboardWriting", "NSSecureCoding"], "package_name": "foundation", "subclass_list": []}