{"subclass_list": [], "typealias": [], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_name": [], "return_description": ["An NSPortMessage object initialized to send components on sendPort and to receiver replies on receivePort."], "return_type": []}, "method_description": "Initializes a newly allocated NSPortMessage object to send given data on a given port and to receiver replies on another given port.", "is_static": false, "method_name": "init", "class_name": "PortMessage", "method_declar": "init(send sendPort: Port?, receive replyPort: Port?, components: [Any]?)", "params": [{"param_type": "Port", "param_description": "The port on which the message is sent.", "param_name": ["send", "sendPort"]}, {"param_type": "Port", "param_description": "", "param_name": ["receive", "replyPort"]}, {"param_type": "[Any]", "param_description": "The data to send in the message. components should contain only NSData and NSPort objects, and the contents of the NSData objects should be in network byte order.", "param_name": ["components"]}]}, {"return_value": {"return_name": [""], "return_description": ["true if the operation is successful, otherwise false (for example, if the operation times out)."], "return_type": ["Boo"]}, "method_description": "Attempts to send the message before aDate, returning true if successful or false if the operation times out.", "is_static": false, "method_name": "send", "class_name": "PortMessage", "method_declar": "func send(before date: Date) -> Bool", "params": [{"param_type": "Date", "param_description": "", "param_name": ["before", "date"]}]}], "class_type": "class", "class_name": "PortMessage", "Vars": [{"var_name": "components", "var_type": "[Any]", "var_description": "Returns the data components of the receiver.", "is_static": false}, {"var_name": "receivePort", "var_type": "Port", "var_description": "For an outgoing message, returns the port on which replies to the receiver will arrive. For an incoming message, returns the port the receiver did arrive on.", "is_static": false}, {"var_name": "sendPort", "var_type": "Port", "var_description": "For an outgoing message, returns the port the receiver will send itself through. For an incoming message, returns the port replies to the receiver should be sent through.", "is_static": false}, {"var_name": "msgid", "var_type": "UInt32", "var_description": "Returns the identifier for the receiver.", "is_static": false}], "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_description": "Port messages are used primarily by the distributed objects system. You should implement inter-application communication using distributed objects whenever possible and use PortMessage only when necessary.\nAn PortMessage object has three major parts: the send and receive ports, which are Port objects that link the sender of the message to the receiver, and the components, which form the body of the message. The components are held as an NSArray object containing NSData and Port objects. The send(before:) message sends the components out through the send port; any replies to the message arrive on the receive port. See the Port class specification for information on handling incoming messages.\nAn PortMessage instance can be initialized with a pair of Port objects and an array of components. A port message's body can contain only Port objects or NSData objects. In the distributed objects system the byte/character arrays are usually encoded NSInvocation objects that are being forwarded from a proxy to the corresponding real object.\nAn PortMessage object also maintains a message identifier, which can be used to indicate the class of a message, such as an Objective-C method invocation, a connection request, an error, and so on. Use the msgid and msgid methods to access the identifier.\n", "package_name": "foundation"}