{"class_description": "This class's interface is common to all Cocoa stream classes, including its concrete subclasses InputStream and OutputStream.\nStream objects provide an easy way to read and write data to and from a variety of media in a device-independent way. You can create stream objects for data located in memory, in a file, or on a network (using sockets), and you can use stream objects without loading all of the data into memory at once. \nBy default, Stream instances that are not file-based are non-seekable, one-way streams (although custom seekable subclasses are possible). Once the data has been provided or consumed, the data cannot be retrieved from the stream. \nNSStream is an abstract class, incapable of instantiation and intended to be subclassed. It publishes a programmatic interface that all subclasses must adopt and provide implementations for. The two Apple-provided concrete subclasses of NSStream, InputStream and OutputStream, are suitable for most purposes. However, there might be situations when you want a peer subclass to NSInputStream and NSOutputStream. For example, you might want a class that implements a full-duplex (two-way) stream, or a class whose instances are capable of seeking through a stream.\nAll subclasses must fully implement the following methods, which are presented in functional pairs:\nopen() and close()\nImplement open() to open the stream for reading or writing and make the stream available to the client directly or, if the stream object is scheduled on a run loop, to the delegate. Implement close() to close the stream and remove the stream object from the run loop, if necessary. A closed stream should still be able to accept new properties and report its current properties. Once a stream is closed, it cannot be reopened. \ndelegate and delegate\nReturn and set the delegate. By a default, a stream object must be its own delegate; so a delegate message with an argument of nil should restore this delegate. Do not retain the delegate to prevent retain cycles.\nTo learn about delegates and delegation, read \"Delegation\" in Cocoa Fundamentals Guide.\nschedule(in:forMode:) and remove(from:forMode:)\nImplement schedule(in:forMode:) to schedule the stream object on the specified run loop for the specified mode. Implement remove(from:forMode:) to remove the object from the run loop. See the documentation of the RunLoop class for details. Once the stream object for an open stream is scheduled on a run loop, it is the responsibility of the subclass as it processes stream data to send stream(_:handle:) messages to its delegate.\nproperty(forKey:) and setProperty(_:forKey:)\nImplement these methods to return and set, respectively, the property value for the specified key. You may add custom properties, but be sure to handle all properties defined by NSStream as well.\nstreamStatus and streamError\nImplement streamStatus to return the current status of the stream as a NSStreamStatus constant; you may define new NSStreamStatus constants, but be sure to handle the NSStream-defined constants properly. ImplementstreamError to return an NSError object representing the current error. You might decide to return a custom NSError object that can provide complete and localized information about the error.\n", "Methods": [], "class_inherit_list": ["NSObject"], "class_name": "Stream", "typealias": [], "Vars": [{"var_description": "The error domain used by NSError when reporting SSL errors.", "var_type": "String", "is_static": false, "var_name": "NSStreamSocketSSLErrorDomain"}, {"var_description": "The error domain used by NSError when reporting SOCKS errors.", "var_type": "String", "is_static": false, "var_name": "NSStreamSOCKSErrorDomain"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable"], "package_name": "foundation", "subclass_list": []}