{"class_description": "You register an undo operation by calling one of the methods described in Registering Undo Operations. You specify the name of the object that’s changing (or the owner of that object) and provide a closure, method, or invocation to revert its state.\nAfter you register an undo operation, you can call undo() on the undo manager to revert to the state of the last undo operation. When undoing an action, UndoManager saves the operations you reverted to so that you can call redo() automatically.\nUndoManager is typically used by apps with UI interactions. For example, UIKit implements undo and redo in its text view object, making it easy for you to undo and redo actions in objects along the responder chain. UndoManager also serves as a general-purpose state manager, which can be used to undo and redo many kinds of actions. For example, an interactive command-line utility could use this class to undo the last command run, or a networking library could undo a request by sending another request that invalidates the previous one.\n", "Methods": [], "class_inherit_list": ["NSObject"], "class_name": "UndoManager", "typealias": [], "Vars": [{"var_description": "Posted whenever an NSUndoManager object opens or closes an undo group (except when it opens a top-level group) and when checking the redo stack in canRedo. ", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerCheckpoint"}, {"var_description": "Posted whenever an NSUndoManager object opens an undo group, which occurs in the implementation of the beginUndoGrouping() method. ", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerDidOpenUndoGroup"}, {"var_description": "Posted just after an NSUndoManager object performs a redo operation (redo()).", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerDidRedoChange"}, {"var_description": "Posted just after an NSUndoManager object performs an undo operation.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerDidUndoChange"}, {"var_description": "Posted before an NSUndoManager object closes an undo group, which occurs in the implementation of the endUndoGrouping() method.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerWillCloseUndoGroup"}, {"var_description": "Posted after an NSUndoManager object closes an undo group, which occurs in the implementation of the endUndoGrouping() method.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerDidCloseUndoGroup"}, {"var_description": "Posted just before an NSUndoManager object performs a redo operation (redo()).", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerWillRedoChange"}, {"var_description": "Posted just before an NSUndoManager object performs an undo operation.", "var_type": "NSNotification.Name", "is_static": false, "var_name": "NSUndoManagerWillUndoChange"}], "class_type": "class", "interface_list": ["CVarArg", "Equatable", "Hashable"], "package_name": "foundation", "subclass_list": []}