{"package_name": "javax.crypto", "subclass_list": ["NullCipher", "NullCipher"], "class_description": "This class provides the functionality of a cryptographic cipher for\n encryption and decryption. It forms the core of the Java Cryptographic\n Extension (JCE) framework. In order to create a Cipher object, the application calls the\n Cipher's getInstance method, and passes the name of the\n requested transformation to it. Optionally, the name of a provider\n may be specified. A transformation is a string that describes the operation (or\n set of operations) to be performed on the given input, to produce some\n output. A transformation always includes the name of a cryptographic\n algorithm (e.g., DES), and may be followed by a feedback mode and\n padding scheme. A transformation is of the form: (in the latter case,\n provider-specific default values for the mode and padding scheme are used).\n For example, the following is a valid transformation: Modes such as Authenticated Encryption with Associated Data (AEAD)\n provide authenticity assurances for both confidential data and\n Additional Associated Data (AAD) that is not encrypted.  (Please see\n  RFC 5116  for more\n information on AEAD and AEAD algorithms such as GCM/CCM.) Both\n confidential and AAD data can be used when calculating the\n authentication tag (similar to a Mac).  This tag is appended\n to the ciphertext during encryption, and is verified on decryption. AEAD modes such as GCM/CCM perform all AAD authenticity calculations\n before starting the ciphertext authenticity calculations.  To avoid\n implementations having to internally buffer ciphertext, all AAD data\n must be supplied to GCM/CCM implementations (via the updateAAD methods) before the ciphertext is processed (via\n the update and doFinal methods). Note that GCM mode has a uniqueness requirement on IVs used in\n encryption with a given key. When IVs are repeated for GCM\n encryption, such usages are subject to forgery attacks. Thus, after\n each encryption operation using GCM mode, callers should re-initialize\n the cipher objects with GCM parameters which has a different IV value. Android provides the following Cipher transformations: ", "class_type": "class", "typealias": [], "interface_list": [""], "class_inherit_list": ["Object"], "Methods": [], "class_name": "Cipher", "Vars": null}