{"package_name": "java.net", "subclass_list": [], "class_description": "The abstract class ContentHandler is the superclass\n of all classes that read an Object from a\n URLConnection. An application does not generally call the\n getContent method in this class directly. Instead, an\n application calls the getContent method in class\n URL or in URLConnection.\n The application's content handler factory (an instance of a class that\n implements the interface ContentHandlerFactory set\n up by a call to setContentHandler) is\n called with a String giving the MIME type of the\n object being received on the socket. The factory returns an\n instance of a subclass of ContentHandler, and its\n getContent method is called to create the object. If no content handler could be found, URLConnection will\n look for a content handler in a user-defineable set of places.\n By default it looks in sun.net.www.content, but users can define a\n vertical-bar delimited set of class prefixes to search through in\n addition by defining the java.content.handler.pkgs property.\n The class name must be of the form: ", "class_type": "class", "typealias": [], "interface_list": [""], "class_inherit_list": ["Object"], "Methods": [{"params": [], "class_name": "ContentHandler", "is_static": false, "return_value": {"return_name": "", "return_description": [], "return_type": []}, "method_name": "init", "method_description": "\n", "method_declar": ""}, {"params": [{"param_name": ["urlc"], "param_type": "URLConnection", "param_description": " a URL connection."}, {"param_name": ["classes"], "param_type": "Class[]", "param_description": " an array of types requested"}], "class_name": "ContentHandler", "is_static": false, "return_value": {"return_name": [], "return_description": ["the object read by the ContentHandler that is\n                 the first match of the suggested types.\n                 null if none of the requested  are supported."], "return_type": ["Object"]}, "method_name": "getContent", "method_description": "Given a URL connect stream positioned at the beginning of the\n representation of an object, this method reads that stream and\n creates an object that matches one of the types specified.\n\n The default implementation of this method should call getContent()\n and screen the return type for a match of the suggested types.\n", "method_declar": ""}], "class_name": "ContentHandler", "Vars": null}