{"package_name": "java.text", "subclass_list": ["DateFormat", "MessageFormat", "NumberFormat", "SelectFormat", "UFormat", "DateFormat", "MessageFormat", "NumberFormat", "SelectFormat", "UFormat", "Format"], "class_description": "Format is an abstract base class for formatting locale-sensitive\n information such as dates, messages, and numbers. Format defines the programming interface for formatting\n locale-sensitive objects into Strings (the\n format method) and for parsing Strings back\n into objects (the parseObject method). Generally, a format's parseObject method must be able to parse\n any string formatted by its format method. However, there may\n be exceptional cases where this is not possible. For example, a\n format method might create two adjacent integer numbers with\n no separator in between, and in this case the parseObject could\n not tell which digits belong to which number. The Java Platform provides three specialized subclasses of Format--\n DateFormat, MessageFormat, and\n NumberFormat--for formatting dates, messages, and numbers,\n respectively. Concrete subclasses must implement three methods: Most subclasses will also implement the following factory methods: Subclasses of Format that allow programmers to create objects\n for locales (with getInstance(Locale) for example)\n must also implement the following class method: And finally subclasses may define a set of constants to identify the various\n fields in the formatted output. These constants are used to create a FieldPosition\n object which identifies what information is contained in the field and its\n position in the formatted result. These constants should be named\n item_FIELD where item identifies\n the field. For examples of these constants, see ERA_FIELD and its\n friends in DateFormat. Formats are generally not synchronized.\n It is recommended to create separate format instances for each thread.\n If multiple threads access a format concurrently, it must be synchronized\n externally. ", "class_type": "class", "typealias": [], "interface_list": ["Serializable", "Cloneable"], "class_inherit_list": ["Object"], "Methods": [], "class_name": "Format", "Vars": null}