{"package_name": "java.nio.channels", "subclass_list": ["DatagramChannel", "DatagramChannel"], "class_description": "A network channel that supports Internet Protocol (IP) multicasting. IP multicasting is the transmission of IP datagrams to members of\n a group that is zero or more hosts identified by a single destination\n address. In the case of a channel to an StandardProtocolFamily#INET socket,\n the underlying operating system supports \nRFC 2236: Internet Group Management Protocol, Version 2 (IGMPv2).\n It may optionally support source filtering as specified by  RFC 3376: Internet Group\n Management Protocol, Version 3 (IGMPv3).\n For channels to an StandardProtocolFamily#INET6 socket, the equivalent\n standards are  RFC 2710:\n Multicast Listener Discovery (MLD) for IPv6 and  RFC 3810: Multicast Listener\n Discovery Version 2 (MLDv2) for IPv6. The join(java.net.InetAddress, java.net.NetworkInterface) method is used to\n join a group and receive all multicast datagrams sent to the group. A channel\n may join several multicast groups and may join the same group on several\n NetworkInterface. Membership is dropped by invoking the MembershipKey#drop method on the returned MembershipKey. If the\n underlying platform supports source filtering then the MembershipKey#block and MembershipKey#unblock methods can be used to block or\n unblock multicast datagrams from particular source addresses. The join(java.net.InetAddress, java.net.NetworkInterface, java.net.InetAddress) method\n is used to begin receiving datagrams sent to a group whose source address matches\n a given source address. This method throws UnsupportedOperationException\n if the underlying platform does not support source filtering.  Membership is\n cumulative and this method may be invoked again with the same group\n and interface to allow receiving datagrams from other source addresses. The\n method returns a MembershipKey that represents membership to receive\n datagrams from the given source address. Invoking the key's MembershipKey#drop method drops membership so that datagrams from the\n source address can no longer be received. ", "class_type": "interface", "typealias": [], "interface_list": ["NetworkChannel"], "class_inherit_list": [], "Methods": [], "class_name": "MulticastChannel", "Vars": null}